{"_id": "CS-ANI-001_QSG_v1.0", "product_id": "CS-ANI-001", "product_name": "AniMate Junior Tablet", "doc_type": "Quick Start Guide", "version": "1.0", "title": "AniMate Junior Tablet Quick Start Guide", "language": "en-US", "format": "Markdown", "text": "# AniMate Junior Tablet Quick Start Guide (v1.0)\n\nLet's start animating!\n\n## What's in the Box\n\n*   AniMate Junior Tablet\n*   Simplified Stylus\n*   USB Charging Cable\n*   This Quick Start Guide\n\n## Charging the Tablet\n\n1.  Connect the small end of the USB Charging Cable to the charging port on the tablet.\n2.  Connect the large end to a standard USB power adapter (like for a phone, adapter not included) or a computer's USB port.\n3.  A charging light will indicate it's charging (e.g., red light).\n4.  Allow 2-3 hours for a full charge. The light may turn green or off when complete.\n\n## Turning On/Off\n\n*   **Turn On:** Press and hold the Power Button (usually on the side or top edge) for a few seconds until the screen lights up.\n*   **Turn Off:** Press and hold the Power Button again, then follow any on-screen prompts to confirm power off.\n\n## Using the Stylus\n\n*   The stylus works like a pen on the tablet screen.\n*   Hold it comfortably and draw directly on the screen within the animation app.\n*   Store the stylus in the holder on the tablet (if applicable) when not in use.\n\n## Launching the Animation App\n\n*   The AniMate software should start automatically after the tablet boots up, or there will be a large, clear icon on the main screen to tap.\n\n## First Animation\n\n*   Follow the on-screen tutorial within the app (if available).\n*   Or, try drawing a simple shape, tapping the 'Next Frame' button, drawing the shape in a slightly different position, and repeating a few times.\n*   Press the 'Play' button to see your animation!\n\nFor detailed software instructions, see the Software User Manual (CS-ANI-001_SUM_v1.2)."}
{"_id": "CS-ANI-001_SUM_v1.2", "product_id": "CS-ANI-001", "product_name": "AniMate Junior Tablet", "doc_type": "Software User Manual", "version": "1.2", "title": "AniMate Junior Animation Software User Manual", "language": "en-US", "format": "Markdown", "text": "# AniMate Junior Animation Software User Manual (v1.2)\n\nCreate amazing animations easily!\n\n## Main Interface Overview\n\n*(Screenshot: Main animation screen with areas labelled)*\n\n*   **Canvas:** The main drawing area where you create each frame.\n*   **Timeline / Frame Strip:** Shows small versions (thumbnails) of your animation frames in order. Tap a frame to jump to it.\n*   **Tool Palette:** Contains drawing tools (Pen, Eraser), Color Picker, etc.\n*   **Playback Controls:** Play, Stop, Loop buttons.\n*   **Frame Controls:** Add New Frame (+), Duplicate Frame, Delete Frame buttons.\n*   **Library Button:** Access pre-set backgrounds, characters, and sound effects.\n*   **Export Button:** Save your animation.\n*   **Settings/Help:** Access software settings or help guides.\n\n## Drawing Tools\n\n*   **Pen Tool:** Select this to draw. Tap the tool again to potentially change brush size or style (simplified options).\n*   **Eraser Tool:** Select this to erase parts of your drawing.\n*   **Color Picker:** Tap to open a palette of pre-selected colors. Tap a color to make it active for the Pen tool.\n*   **(Possibly Fill Tool):** Select an area to fill with the current color.\n\n## Creating an Animation Frame-by-Frame\n\n1.  **Start:** The app opens with a blank first frame.\n2.  **Draw Frame 1:** Use the Pen tool and colors to draw the starting point of your animation.\n3.  **Add Next Frame:** Tap the 'Add New Frame' (+) button. This creates a new blank frame *after* the current one.\n4.  **Onion Skinning (Ghost Image):** You should see a faint 'ghost' image of the previous frame on the new blank frame. This helps you see where to draw the next step of the movement.\n5.  **Draw Frame 2:** Draw the next stage of your animation, using the onion skin as a guide.\n6.  **Repeat:** Keep adding frames (+) and drawing the progressive steps of the movement.\n7.  **Playback:** Press the 'Play' button at any time to preview your animation.\n\n## Using Libraries\n\n1.  Tap the 'Library' button.\n2.  Select a category (Backgrounds, Characters, Props, Sounds).\n3.  Tap an item to add it to your current frame (or assign a sound).\n4.  You can often move, resize, or rotate library items after adding them using selection tools (if available).\n\n## Adding Sound\n\n1.  Navigate to the frame where you want a sound to start.\n2.  Open the Sound Library.\n3.  Tap a sound effect (e.g., 'Boing', 'Zap', 'Music Loop').\n4.  The sound will be associated with that frame during playback.\n\n## Saving and Exporting\n\n1.  Tap the 'Export' or 'Save' button.\n2.  Choose a format (usually GIF or MP4 video for this device).\n3.  Give your animation a name.\n4.  Confirm the export.\n5.  Exported files are saved internally. You may need to connect the tablet via USB to a computer to transfer the files off the device (see device instructions for file transfer).\n\n## Settings\n\n*   Access settings to adjust animation speed (Frames Per Second - FPS), toggle onion skinning, etc."}
{"_id": "CS-ANI-001_CPIG_v1.0", "product_id": "CS-ANI-001", "product_name": "AniMate Junior Tablet", "doc_type": "Creative Project Ideas Guide", "version": "1.0", "title": "AniMate Junior Creative Project Ideas", "language": "en-US", "format": "Markdown", "text": "# AniMate Junior Creative Project Ideas (v1.0)\n\nGet inspired to animate!\n\n## Project 1: Bouncing Ball\n\n*   **Concept:** The classic animation exercise!\n*   **Steps:**\n    1.  Frame 1: Draw a ball near the top of the screen.\n    2.  Next Frame: Draw the ball slightly lower and maybe starting to squash slightly.\n    3.  Next Frames: Continue moving the ball down, squashing it more as it nears the 'ground'.\n    4.  Impact Frame: Draw the ball very squashed on the 'ground'.\n    5.  Next Frames: Draw the ball stretching back up and moving upwards.\n    6.  Continue until it reaches near the top again, becoming rounder.\n    7.  Play it back! Adjust timing by duplicating frames where you want pauses.\n*   **Tip:** Exaggerate the squash and stretch for a fun effect.\n\n## Project 2: Character Wave\n\n*   **Concept:** Make a simple character wave hello.\n*   **Steps:**\n    1.  Draw your character with their arm down.\n    2.  Next Frame: Draw the arm slightly raised.\n    3.  Next Frames: Continue raising the arm until it's in the waving position.\n    4.  Next Frames: Animate the hand moving back and forth a few times.\n    5.  Next Frames: Animate the arm lowering back down.\n*   **Tip:** Use the Library to add a pre-made character and focus just on animating the arm.\n\n## Project 3: Growing Flower\n\n*   **Concept:** Animate a seed sprouting and growing into a flower.\n*   **Steps:**\n    1.  Frame 1: Draw a small seed in the 'ground'.\n    2.  Next Frame: Show a tiny sprout emerging.\n    3.  Next Frames: Draw the stem getting taller frame by frame.\n    4.  Next Frames: Add small leaves appearing and growing.\n    5.  Next Frames: Show a bud forming at the top.\n    6.  Next Frames: Animate the bud opening into petals.\n*   **Tip:** Use different colors to make the flower bloom vibrant.\n\n## Project 4: Moving Car\n\n*   **Concept:** Animate a car driving across the screen.\n*   **Steps:**\n    1.  Choose a background from the Library (or draw a simple road).\n    2.  Frame 1: Draw a car on one side of the screen.\n    3.  Next Frame: Draw the car moved slightly across the screen. Animate the wheels turning a little.\n    4.  Repeat: Keep moving the car across the screen in small steps, rotating the wheels each time.\n*   **Tip:** Add a simple sound effect from the library when the car starts moving.\n\n## Project 5: Shape Shifter\n\n*   **Concept:** Morph one shape into another.\n*   **Steps:**\n    1.  Frame 1: Draw a simple shape (e.g., a square).\n    2.  Next Frame: Draw the shape slightly changed, starting to look like the target shape (e.g., corners rounding to become a circle).\n    3.  Repeat: Gradually change the drawing frame by frame until it fully transforms into the second shape.\n*   **Tip:** Onion skinning is very helpful here!\n\nHave fun exploring and creating your own stories!"}
{"_id": "CS-ANI-001_TSF_v1.1", "product_id": "CS-ANI-001", "product_name": "AniMate Junior Tablet", "doc_type": "Troubleshooting & Support FAQ", "version": "1.1", "title": "AniMate Junior Troubleshooting & Support FAQ", "language": "en-US", "format": "Markdown", "text": "# AniMate Junior Troubleshooting & Support FAQ (v1.1)\n\nHaving trouble? Let's figure it out.\n\n## Tablet Issues\n\n*   **Tablet Won't Turn On:**\n    *   Ensure battery is charged. Connect to charger for at least 30 minutes and try again.\n    *   Press and hold the Power Button firmly for 5-10 seconds.\n    *   If light comes on but screen stays black, contact support.\n*   **Tablet Frozen / Unresponsive:**\n    *   Press and hold the Power Button for 10-15 seconds to force a shutdown. Wait a few seconds, then try turning it back on.\n    *   If it frequently freezes, ensure software is up-to-date (if update mechanism exists) or consider a factory reset (Warning: Deletes data! See reset instructions if available or contact support).\n*   **Stylus Not Working:**\n    *   Ensure you are using the correct stylus that came with the tablet.\n    *   Check if the stylus tip is damaged.\n    *   Restart the tablet.\n    *   Clean the screen gently.\n    *   If it still doesn't work, contact support.\n*   **Cannot Charge:**\n    *   Try a different USB cable and USB power adapter.\n    *   Check the charging port on the tablet for debris or damage.\n\n## Software Issues\n\n*   **App Won't Load / Crashes:**\n    *   Restart the tablet.\n    *   Check if a software update is available (if applicable).\n    *   As a last resort, a factory reset might fix it, but **this will erase all your animations!** Contact support first.\n*   **Animation Playback Jerky:**\n    *   Very complex drawings or too many library items on a frame can slow performance.\n    *   Try reducing complexity or creating shorter animations.\n    *   Ensure tablet isn't running too many things (though it's usually a dedicated device).\n*   **Cannot Export Animation:**\n    *   Ensure there is enough free storage space on the tablet.\n    *   Try exporting in a different format (GIF vs MP4) if available.\n    *   Restart the tablet and try again.\n*   **Cannot Transfer Files to Computer:**\n    *   Ensure tablet is connected via USB cable to the computer.\n    *   The tablet may need to be put into a specific 'File Transfer' mode when connected via USB (check for notifications on the tablet screen).\n    *   Try a different USB port on the computer.\n    *   Ensure computer's operating system recognizes the device (may appear as a removable drive).\n\n## Contacting Support\n\n*   If these steps don't resolve your issue, please visit the Kinetic Constructs support website [Example: support.kineticconstructs.com] or contact us via [Example: support@kineticconstructs.com], providing your product model (CS-ANI-001) and a description of the problem."}
{"_id": "CS-ANI-001_CSG_v1.0", "product_id": "CS-ANI-001", "product_name": "AniMate Junior Tablet", "doc_type": "Care & Safety Guide", "version": "1.0", "title": "AniMate Junior Tablet Care & Safety Guide", "language": "en-US", "format": "Markdown", "text": "# AniMate Junior Tablet Care & Safety Guide (v1.0)\n\nKeep your animation tablet safe and working well!\n\n## Care Instructions\n\n*   **Cleaning the Screen:** Use a soft, dry microfiber cloth. For stubborn smudges, slightly dampen the cloth with water or screen cleaner approved for LCD/touch screens. Do NOT spray liquid directly onto the screen. Avoid abrasive cloths or cleaners.\n*   **Cleaning the Body:** Wipe the plastic casing with a dry or slightly damp cloth.\n*   **Stylus Care:** Store the stylus properly. Do not press excessively hard on the screen. Keep the tip clean.\n*   **Charging Port:** Keep the USB charging port free of dust and debris. Connect and disconnect the cable gently.\n*   **Storage:** Store the tablet in a safe place where it won't be dropped or have heavy objects placed on it. Avoid extreme temperatures (hot or cold) and direct sunlight.\n*   **Protection:** Consider a protective case or sleeve if available/compatible.\n\n## Safety Precautions\n\n*   **Battery Safety (Internal Rechargeable):**\n    *   Contains a non-user-replaceable Lithium-ion or Lithium-polymer battery.\n    *   Charge only using the provided USB cable and a certified USB power source.\n    *   Do not attempt to open the tablet casing or replace the battery yourself.\n    *   Do not expose the tablet to fire, excessive heat, or water.\n    *   Stop using and charging immediately if the tablet becomes excessively hot, swells, smokes, or emits an odor. Contact support.\n    *   Dispose of the tablet according to local electronic waste regulations.\n*   **Screen Safety:** While durable, the screen can crack if dropped hard or hit with sharp objects. Do not place heavy items on the screen.\n*   **Electrical Safety:** Use only the specified charging method. Do not use damaged cables or chargers.\n*   **Small Parts (Stylus):** The stylus could be a choking hazard for very young children if put in the mouth. Recommended for ages 6+.\n*   **Supervision:** Adult supervision is recommended, especially for younger users.\n*   **Comfort:** Encourage breaks during long animation sessions to avoid eye strain or wrist discomfort."}
{"_id": "CS-ANI-002_QSG_v1.0", "product_id": "CS-ANI-002", "product_name": "AniMate Pro Tablet", "doc_type": "Quick Start Guide", "version": "1.0", "title": "AniMate Pro Tablet Quick Start Guide", "language": "en-US", "format": "Markdown", "text": "# AniMate Pro Tablet Quick Start Guide (v1.0)\n\nUnlock advanced animation capabilities.\n\n## What's in the Box\n\n*   AniMate Pro Tablet\n*   Pressure-Sensitive Stylus Pro\n*   USB-C Cable (for charging and connection)\n*   Power Adapter\n*   Stylus Holder / Nib Replacement Tool (check box)\n*   Spare Stylus Nibs (check box)\n*   This Quick Start Guide\n\n## Charging the Tablet\n\n1.  Connect the USB-C Cable to the tablet and to the Power Adapter.\n2.  Plug the Power Adapter into a wall outlet.\n3.  Charging indicator will show status. Allow approx 2-4 hours for a full charge.\n\n## Turning On/Off\n\n*   **Turn On:** Press and hold the Power Button until the screen activates.\n*   **Turn Off:** Press and hold the Power Button, follow on-screen prompts.\n\n## Setting Up Wi-Fi (Optional but Recommended)\n\n*   During initial setup or via the Settings menu, connect to your Wi-Fi network.\n*   This allows for software updates, cloud backups (if supported), and potentially accessing online resources.\n\n## Using the Stylus Pro\n\n*   **Pressure Sensitivity:** The harder you press, the thicker or more opaque the line will be (depending on the selected brush).\n*   **Tilt Sensitivity (if supported):** Tilting the stylus may change the brush shape or behavior.\n*   **Buttons (if present):** Buttons on the stylus can often be customized in the software settings (e.g., for Eraser toggle, Undo).\n*   **Nibs:** Nibs wear out over time. Use the included tool to gently remove the old nib and insert a new one if drawing feels scratchy.\n\n## Launching AniMate Pro Software\n\n*   Tap the AniMate Pro application icon on the main screen or home menu.\n\n## Exploring the Interface\n\n*   The Pro software has more features than the Junior version (layers, advanced brushes, more export options).\n*   Take time to explore the menus and tool palettes.\n*   Refer to the full Software User Manual (CS-ANI-002_SUM_v1.0) for details.\n\n## Connecting to Computer (Optional)\n\n*   You can connect the tablet to a PC/Mac using the USB-C cable for file transfer (exporting animations) or potentially as a drawing display for desktop software (check compatibility)."}
{"_id": "CS-ANI-002_SUM_v1.0", "product_id": "CS-ANI-002", "product_name": "AniMate Pro Tablet", "doc_type": "Software User Manual", "version": "1.0", "title": "AniMate Pro Animation Software User Manual", "language": "en-US", "format": "Markdown", "text": "# AniMate Pro Animation Software User Manual (v1.0)\n\nMaster advanced animation techniques.\n\n## Interface Overview\n\n*(Screenshot: Pro interface showing Canvas, Timeline, Layers Panel, Advanced Tool Palette)*\n\n*   **Canvas:** High-resolution drawing area.\n*   **Timeline:** Detailed frame view with layer visibility per frame, frame rate control, playback controls.\n*   **Layers Panel:** Create, delete, reorder, hide/show, and adjust opacity of layers. Essential for separating background, characters, foreground elements.\n*   **Tool Palette (Advanced):**\n    *   **Brushes:** Wide variety of brushes (pencil, ink, airbrush) with pressure/tilt sensitivity settings.\n    *   **Selection Tools:** Lasso, Marquee for selecting parts of a drawing to move, resize, rotate, copy/paste.\n    *   **Transform Tools:** Scale, Rotate, Skew selected elements or layers.\n    *   **Color Palette:** Advanced color picker (HSB, RGB), swatches, gradients.\n    *   **Text Tool:** Add text elements.\n*   **Frame Controls:** Insert/Delete frames, Duplicate frames, Set frame duration.\n*   **Onion Skinning:** Customizable onion skinning (number of frames before/after, color tinting).\n*   **Audio Tracks:** Import and manage audio tracks aligned with the timeline.\n*   **Export Options:** Extensive export settings (MP4, GIF, PNG sequence, etc.), resolution, quality control.\n*   **Settings:** Customize stylus buttons, canvas settings, performance options.\n\n## Working with Layers\n\n*   **Concept:** Think of layers like transparent sheets stacked on top of each other.\n*   **Use Cases:**\n    *   Keep background on a bottom layer.\n    *   Draw main character on a middle layer.\n    *   Add foreground elements or effects on a top layer.\n*   **Benefits:** Allows editing one element without affecting others. Makes complex scenes manageable.\n*   **Creating/Managing:** Use the Layers Panel (+) to add, trashcan to delete, drag to reorder.\n\n## Advanced Animation Techniques\n\n*   **Keyframing (Simple):** While primarily frame-by-frame, some tools might allow setting key poses on different frames and having the software interpolate simple movements (tweening) for selected layers/objects (check software features).\n*   **Camera Movements (Simulated):** Animate movement by moving/scaling background layers relative to foreground layers to simulate pans or zooms.\n*   **Lip Syncing:** Draw different mouth shapes on separate frames or layers timed to an imported audio track.\n\n## Brush Customization\n\n*   Explore the brush settings panel.\n*   Adjust size, opacity, flow based on stylus pressure.\n*   Experiment with different brush textures and shapes.\n\n## Audio Integration\n\n*   Import audio files (MP3, WAV).\n*   Align audio waveforms on the timeline.\n*   Animate visuals to match sound cues.\n\n## Exporting for Different Platforms\n\n*   **GIF:** Good for short, looping web animations.\n*   **MP4:** Standard video format for sharing on social media or video platforms.\n*   **PNG Sequence:** Export each frame as a separate image file for use in professional video editing software.\n*   Choose appropriate resolution and frame rate (FPS) for your target platform (e.g., 24 FPS for film-like look, 30/60 FPS for smooth video).\n\n## Cloud Sync / Backups (If Applicable)\n\n*   Use the Wi-Fi connection and software settings to potentially back up projects to a cloud service or sync across devices."}
{"_id": "CS-ANI-002_CPIG_v1.0", "product_id": "CS-ANI-002", "product_name": "AniMate Pro Tablet", "doc_type": "Creative Project Ideas Guide", "version": "1.0", "title": "AniMate Pro Creative Project Ideas", "language": "en-US", "format": "Markdown", "text": "# AniMate Pro Creative Project Ideas (v1.0)\n\nLeverage Pro features for richer animations.\n\n## Project 1: Layered Landscape Scene\n\n*   **Concept:** Create depth using layers.\n*   **Steps:**\n    1.  Bottom Layer: Draw distant mountains and sky.\n    2.  Middle Layer: Draw mid-ground hills and trees.\n    3.  Top Layer: Draw foreground elements like rocks, grass, maybe a small character.\n    4.  Animate: Make clouds drift slowly on the sky layer. Have the character move on the top layer. The background layers remain stationary, creating parallax.\n*   **Pro Features:** Layers, Opacity (for distant haze).\n\n## Project 2: Expressive Character Dialogue\n\n*   **Concept:** Animate a character talking with lip sync and expressions.\n*   **Steps:**\n    1.  Import a short audio clip of speech.\n    2.  Design your character.\n    3.  Use layers for different parts (head, body, mouth shapes, eyebrows).\n    4.  Scrub through audio waveform on the timeline.\n    5.  Draw appropriate mouth shapes (phonemes like O, E, M/B/P, F/V) on relevant frames, timed to the audio.\n    6.  Animate eyebrow and eye changes to match emotion in the voice.\n*   **Pro Features:** Layers, Audio Tracks, Timeline scrubbing.\n\n## Project 3: Action Sequence with Effects\n\n*   **Concept:** Animate a simple action scene (e.g., character jumping, object exploding).\n*   **Steps:**\n    1.  Plan the key poses (anticipation, action, follow-through).\n    2.  Draw keyframes.\n    3.  Draw in-between frames for smooth motion (frame-by-frame).\n    4.  Add impact effects (speed lines, starbursts, smoke) on separate layers.\n    5.  Use Transform tools to slightly shake the 'camera' (move all layers) during impact.\n*   **Pro Features:** Layers, Transform Tools, Advanced Brushes (for effects).\n\n## Project 4: Rotoscoping\n\n*   **Concept:** Trace over live-action video footage frame by frame to create realistic animated movement.\n*   **Steps:**\n    1.  Import a short video clip onto a bottom layer (if software supports video import/playback).\n    2.  Create a new layer above it.\n    3.  Step through the video frame by frame.\n    4.  Trace the outlines or key shapes of the subject on your drawing layer for each frame.\n    5.  Hide the video layer and play back your traced animation.\n*   **Pro Features:** Layer Opacity, Frame-by-frame control, potential video import.\n\n## Project 5: Animated Logo/Intro\n\n*   **Concept:** Design and animate a short logo reveal or intro sequence.\n*   **Steps:**\n    1.  Design the logo elements.\n    2.  Use layers for different parts of the logo.\n    3.  Animate elements appearing, moving, or transforming using frame-by-frame or simple tweening (if available).\n    4.  Add text using the Text tool.\n    5.  Export as MP4 or GIF.\n*   **Pro Features:** Layers, Text Tool, Export Options.\n\nExperiment with combining these ideas and exploring all the software tools!"}
{"_id": "CS-ANI-002_TSF_v1.0", "product_id": "CS-ANI-002", "product_name": "AniMate Pro Tablet", "doc_type": "Troubleshooting & Support FAQ", "version": "1.0", "title": "AniMate Pro Troubleshooting & Support FAQ", "language": "en-US", "format": "Markdown", "text": "# AniMate Pro Troubleshooting & Support FAQ (v1.0)\n\nResolving issues with your Pro animation tool.\n\n## Tablet & Hardware Issues\n\n*   **(General Tablet Issues: Won't Turn On, Frozen, Charging):** Refer to CS-ANI-001_TSF_v1.1 (steps are similar, use USB-C cable/adapter).\n*   **Stylus Pressure Not Working:**\n    *   Check software settings: Ensure pressure sensitivity is enabled for the current brush tool.\n    *   Check stylus settings within the tablet's main OS settings (if applicable).\n    *   Try replacing the stylus nib.\n    *   Ensure stylus battery is charged (if it's an active stylus requiring charging - check model).\n    *   Restart tablet and software.\n    *   Contact support if persists.\n*   **Stylus Buttons Not Working:**\n    *   Check software settings to ensure buttons are assigned to functions (Undo, Eraser, etc.).\n    *   Restart tablet and software.\n*   **Wi-Fi Connection Issues:**\n    *   Ensure Wi-Fi is enabled on tablet.\n    *   Check password and network selection.\n    *   Restart tablet and Wi-Fi router.\n    *   Move closer to the router.\n\n## Software Issues\n\n*   **Software Running Slow / Laggy:**\n    *   Complex projects with many layers, high resolution, or long durations require more resources. Close other apps (if possible).\n    *   Try reducing canvas resolution for working, increase only for final export.\n    *   Merge layers that don't need to be separate anymore.\n    *   Ensure tablet firmware and animation software are up-to-date.\n    *   Check available storage space; low space can impact performance.\n*   **Layer Problems (Visibility, Order):**\n    *   Check the Layers Panel. Ensure the correct layer is selected, visible (eye icon), and opacity is set appropriately.\n    *   Verify layer order - layers higher in the list appear on top.\n*   **Audio Sync Issues:**\n    *   Ensure audio file format is supported (MP3, WAV usually best).\n    *   Check project frame rate (FPS) matches intended output. Changing FPS mid-project can affect sync.\n    *   Processing/previewing audio may take time on complex projects.\n*   **Export Fails / Corrupted File:**\n    *   Check available storage space on tablet.\n    *   Try exporting with simpler settings (lower resolution, different format) to see if it completes.\n    *   Restart tablet and software.\n    *   Project file might be corrupted. Try duplicating the project and exporting from the copy. Use cloud backup/previous versions if available.\n*   **Cloud Sync / Backup Issues (If Applicable):**\n    *   Ensure tablet is connected to Wi-Fi.\n    *   Check cloud service status (if third-party).\n    *   Ensure you are logged into the correct account.\n    *   Check available cloud storage space.\n\n## Contacting Support\n\n*   Visit the Kinetic Constructs support website or contact support via email, providing your product model (CS-ANI-002) and a detailed description of the issue, including steps to reproduce it if possible."}
{"_id": "CS-ANI-002_CSG_v1.0", "product_id": "CS-ANI-002", "product_name": "AniMate Pro Tablet", "doc_type": "Care & Safety Guide", "version": "1.0", "title": "AniMate Pro Tablet Care & Safety Guide", "language": "en-US", "format": "Markdown", "text": "# AniMate Pro Tablet Care & Safety Guide (v1.0)\n\nProtect your professional animation tool.\n\n## Care Instructions\n\n*   **Screen Care:** Clean with a soft, dry microfiber cloth. For stubborn marks, use screen cleaner approved for high-resolution displays. Avoid pressure. Do not use harsh chemicals.\n*   **Stylus Pro Care:** Store stylus in its holder. Replace nibs when worn using the proper tool. Avoid dropping the stylus. Keep stylus tip clean.\n*   **Body Cleaning:** Wipe casing with a dry or slightly damp cloth.\n*   **Ports:** Keep USB-C port clean. Connect cables carefully.\n*   **Storage:** Store in a protective case/sleeve when not in use. Avoid extreme temperatures, humidity, and direct sunlight.\n*   **Ventilation:** Ensure ventilation openings (if any) on the tablet are not blocked during use to prevent overheating.\n\n## Safety Precautions\n\n*   **Battery Safety (Internal Rechargeable):**\n    *   Contains non-user-replaceable Lithium battery. Follow safety guidelines from CS-ANI-001_CSG_v1.0.\n    *   Use only the provided USB-C cable and power adapter for charging.\n*   **Screen Safety:** Handle carefully to avoid cracks or scratches.\n*   **Electrical Safety:** Use certified charger. Do not use damaged cables.\n*   **Comfort & Ergonomics:** Take regular breaks. Maintain good posture while drawing. Adjust screen brightness to comfortable levels.\n*   **Wi-Fi Security:** If using Wi-Fi, connect only to trusted networks. Keep tablet software updated for security patches.\n*   **Supervision:** While aimed at older users (10+), responsible use is important."}
{"_id": "CS-3DP-001_QSG_v1.0", "product_id": "CS-3DP-001", "product_name": "ProtoPen 3D Printing Pen", "doc_type": "Quick Start Guide", "version": "1.0", "title": "ProtoPen 3D Printing Pen Quick Start Guide", "language": "en-US", "format": "Markdown", "text": "# ProtoPen 3D Printing Pen Quick Start Guide (v1.0)\n\nStart drawing in 3D!\n\n## What's in the Box\n\n*   ProtoPen 3D Pen\n*   USB Charging Cable\n*   Small Starter Pack of Low-Temp Filament\n*   This Quick Start Guide\n*   (Maybe: Simple Templates, Cleaning Tool)\n\n## Charging the Pen\n\n1.  Connect the USB Charging Cable to the port on the ProtoPen.\n2.  Connect the other end to a USB power source (adapter, computer).\n3.  A light indicates charging. Allow 1-2 hours for a full charge.\n\n## Loading Filament\n\n1.  Turn ON the pen using the Power Button. Wait for it to heat up (indicator light may change color or stop flashing - typically < 1 minute).\n2.  Select a strand of the low-temp filament. Ensure the end is cut cleanly (no bends or blobs).\n3.  Insert the filament end into the Filament Loading Port (usually at the back of the pen).\n4.  Gently push the filament in until you feel it engage with the internal mechanism.\n5.  Press and HOLD the 'Load/Extrude' Button (Forward Arrow). The pen's motor will start feeding the filament through.\n6.  Keep holding until you see melted filament emerging from the nozzle tip.\n\n## Drawing in 3D\n\n1.  **Heating:** Ensure the pen is ON and the ready light indicates it's heated.\n2.  **Extruding:** Press and HOLD the 'Load/Extrude' (Forward) button to make filament come out. Release the button to stop.\n3.  **Speed Control:** Some pens have a speed slider; adjust for faster or slower extrusion.\n4.  **Drawing on Surfaces:** Start by drawing on paper or a heat-resistant mat. Move the pen slowly and steadily.\n5.  **Drawing Vertically:** Anchor the filament to your base drawing, then lift the pen slowly upwards while extruding. Hold for a second to let it cool and solidify.\n6.  **Connecting Parts:** Let parts cool slightly, then use the pen to extrude a small amount of filament at the connection point to 'weld' them together.\n\n## Unloading/Changing Filament\n\n1.  Ensure pen is heated and ready.\n2.  Press and HOLD the 'Unload' Button (Backward Arrow or separate button). The motor will reverse and push the filament back out the loading port.\n3.  Gently pull the filament completely out.\n4.  To load a new color, trim the end of the old filament remaining inside (if accessible) or extrude remaining color, then load the new color as described above.\n\n## Turning Off\n\n*   Press the Power Button. Allow pen nozzle to cool completely before storing.\n\n**Safety:** Nozzle tip gets warm, but uses low-temp filament. Adult supervision recommended. See User Guide & Safety Guide for details."}
{"_id": "CS-3DP-001_UG_v1.1", "product_id": "CS-3DP-001", "product_name": "ProtoPen 3D Printing Pen", "doc_type": "User Guide", "version": "1.1", "title": "ProtoPen 3D Printing Pen User Guide", "language": "en-US", "format": "Markdown", "text": "# ProtoPen 3D Printing Pen User Guide (v1.1)\n\nMastering your 3D drawing tool.\n\n## Pen Features Overview\n\n*(Diagram: ProtoPen with buttons and ports labelled)*\n\n*   **Nozzle:** Where melted filament comes out. Gets warm during use.\n*   **Filament Loading Port:** Where filament strands are inserted.\n*   **Power Button:** Turns the pen on/off.\n*   **Heating/Ready Indicator Light:** Shows status (e.g., Red=Heating, Green=Ready, Flashing=Error).\n*   **Load/Extrude Button (Forward):** Press and hold to feed filament forward and draw.\n*   **Unload Button (Backward):** Press and hold to reverse filament out.\n*   **Speed Control Slider (if applicable):** Adjusts extrusion speed.\n*   **Charging Port:** For USB charging cable.\n\n## Getting Started (Detailed)\n\n1.  **Charge Fully:** Ensure pen is fully charged before first use.\n2.  **Power On & Heat:** Turn on. Wait for Ready light.\n3.  **Prepare Filament:** Choose filament color. Cut the end straight across with scissors or flush cutters. Avoid jagged or melted ends.\n4.  **Load Filament:** Insert filament into loading port. Press and hold Load/Extrude button until melted plastic flows smoothly from the nozzle. You may need to extrude a little onto scrap paper first.\n\n## Drawing Techniques\n\n*   **Consistent Speed:** Move the pen at a steady pace. Moving too fast stretches filament thin; too slow creates blobs.\n*   **Anchoring:** Always start your drawing (or vertical structure) by extruding a small blob onto your drawing surface or existing structure to anchor it.\n*   **Vertical Drawing:** After anchoring, lift the pen straight up slowly while extruding. Pause briefly at the desired height to allow cooling before moving horizontally or stopping extrusion.\n*   **Bridging Gaps:** Anchor on one point, move the pen across the gap while extruding, and anchor on the second point. Works best for short distances.\n*   **Filling Areas:** Draw an outline, then fill it in using back-and-forth or spiral motions.\n*   **Using Templates:** Place a printed template under a clear drawing surface (like a plastic sheet or specialized mat). Trace the template lines with the pen.\n*   **Multi-Part Objects:** Draw components separately, let them cool, then use the pen like a welder to join them with small extrusions at the connection points.\n\n## Tips for Success\n\n*   **Patience:** 3D pen drawing takes practice!\n*   **Work Surface:** Use paper, cardboard, or a specialized 3D pen mat. Do not draw directly on furniture.\n*   **Cooling Time:** Allow filament to cool and harden before handling or building upon it (cools quickly).\n*   **Preventing Clogs:**\n    *   Use only the recommended low-temperature filament type.\n    *   Always unload filament fully if storing the pen for more than a few hours.\n    *   Trim filament ends cleanly before loading.\n    *   If a clog occurs, try heating the pen, loading fresh filament, and extruding at high speed. If that fails, refer to Troubleshooting.\n\n## Filament Management\n\n*   Store filament in a cool, dry place, ideally sealed to prevent moisture absorption.\n*   Keep different colors separate.\n*   Use the Unload function to remove filament before switching colors or storing the pen."}
{"_id": "CS-3DP-001_CPIG_v1.0", "product_id": "CS-3DP-001", "product_name": "ProtoPen 3D Printing Pen", "doc_type": "Creative Project Ideas Guide", "version": "1.0", "title": "ProtoPen Creative Project Ideas", "language": "en-US", "format": "Markdown", "text": "# ProtoPen Creative Project Ideas (v1.0)\n\nBring your ideas to life in 3D!\n\n## Beginner Projects (Focus on Flat & Simple Vertical)\n\n*   **Personalized Name Tag/Keychain:** Draw letters flat on paper/mat. Add a loop vertically for a keyring.\n*   **Cookie Cutter Shapes:** Trace simple shapes (star, heart) flat. Build up the walls vertically layer by layer.\n*   **Eyeglasses:** Trace eyeglass frame templates flat. Carefully build up bridge and arms.\n*   **Simple Coasters:** Draw spiral or geometric patterns flat.\n*   **Snowflake Ornaments:** Draw intricate snowflake patterns flat.\n\n## Intermediate Projects (Building Structures)\n\n*   **Basic Cube/Box:** Draw a square flat. Draw four walls vertically from the edges. Draw a separate square lid.\n*   **Wireframe House:** Draw the outline of a house (like a simple line drawing) but build it vertically.\n*   **Model Bridge (Truss):** Draw bridge components (beams, triangles) flat, then assemble them vertically using the pen as a welder.\n*   **Simple Flower with Stem:** Draw petals flat. Draw a stem vertically. Attach petals to the stem.\n*   **Miniature Furniture (for dolls/figures):** Draw chair legs, seat, back separately and assemble.\n\n## Advanced Projects (Sculpting & Detail)\n\n*   **Character Figurine:** Start with a wireframe base structure. Gradually build up volume and details layer by layer. Requires patience!\n*   **Model Car/Airplane:** Draw body sections, wings, wheels separately and assemble. Add details.\n*   **Wearable Art (Bracelets, Decorations):** Draw designs that can be joined into wearable forms (ensure filament is non-toxic and finished object isn't scratchy).\n*   **Sculptural Forms:** Experiment with freeform drawing in the air, creating abstract shapes and textures.\n*   **Repairing Plastic Objects:** Use the pen carefully to mend cracks or join broken plastic parts (works best with similar low-temp plastics).\n\n## Tips for Projects\n\n*   **Plan Your Build:** Sketch your idea first. Think about how to break it down into drawable parts.\n*   **Start Simple:** Master basic techniques before tackling complex sculptures.\n*   **Work in Sections:** Don't try to draw huge objects all at once. Build components and join them.\n*   **Use Supports (if needed):** For large overhangs, you might draw temporary vertical supports that can be cut away later.\n*   **Experiment!** Try different colors, speeds, and movements."}
{"_id": "CS-3DP-001_TSF_v1.0", "product_id": "CS-3DP-001", "product_name": "ProtoPen 3D Printing Pen", "doc_type": "Troubleshooting & Support FAQ", "version": "1.0", "title": "ProtoPen Troubleshooting & Support FAQ", "language": "en-US", "format": "Markdown", "text": "# ProtoPen Troubleshooting & Support FAQ (v1.0)\n\nFixing common 3D pen issues.\n\n## Pen & Power Issues\n\n*   **Pen Won't Turn On:** Ensure battery is charged. Press and hold Power Button. Try charging again.\n*   **Pen Won't Heat Up / Ready Light Stays Off/Flashing:** Turn off, wait, turn on again. Ensure battery is charged. If persists, internal issue - contact support.\n*   **Pen Shuts Off During Use:** Battery may be low - recharge. Pen might have auto-shutoff timer - turn back on. If it overheats (unlikely with low-temp), let it cool.\n\n## Filament & Extrusion Issues\n\n*   **Filament Won't Load:**\n    *   Ensure pen is heated to Ready state.\n    *   Cut filament end cleanly.\n    *   Push filament gently but firmly into loading port while holding Load button.\n    *   Possible internal jam/clog (see below).\n*   **Filament Won't Extrude (Motor Runs but Nothing Comes Out):**\n    *   **Clog:** Most common issue. Try heating pen, loading fresh filament, and extruding at high speed. If that fails, carefully try using a 'cleaning filament' or follow specific unclogging instructions if provided (may involve fine wire - CAUTION: Nozzle is warm). Contact support if unable to clear.\n    *   **Broken Filament Inside:** Unload filament. If it breaks off inside, may need careful removal or professional help.\n    *   **Incorrect Filament Type:** Ensure using compatible low-temperature filament.\n*   **Filament Won't Unload (Motor Runs but Filament Stuck):**\n    *   Ensure pen is heated.\n    *   Gently pull filament while holding Unload button.\n    *   Filament end might be blobbed/jammed near nozzle. Try extruding a small amount forward first, then immediately try unloading again.\n    *   Cut filament externally close to loading port, then try loading new filament to push the old piece through (can sometimes work, sometimes worsen jam).\n*   **Extrusion Inconsistent (Blobs, Thin Strings):**\n    *   Adjust speed control (if available).\n    *   Practice moving the pen at a more consistent speed.\n    *   Filament quality issue or moisture absorption (try fresh filament).\n*   **Motor Makes Grinding Noise:**\n    *   Possible internal jam putting strain on motor.\n    *   Internal gear issue. Stop use and contact support.\n\n## Drawing Issues\n\n*   **Filament Doesn't Stick to Surface:** Ensure surface is clean and suitable (paper, mat). Start by extruding a small anchor blob.\n*   **Vertical Lines Sag/Fall Over:** Move pen upwards more slowly. Pause briefly to let filament cool. Ensure base anchor is solid.\n\n## Contacting Support\n\n*   Visit Kinetic Constructs support website or email support with model number (CS-3DP-001) and problem description."}
{"_id": "CS-3DP-001_CSG_v1.0", "product_id": "CS-3DP-001", "product_name": "ProtoPen 3D Printing Pen", "doc_type": "Care & Safety Guide", "version": "1.0", "title": "ProtoPen 3D Printing Pen Care & Safety Guide", "language": "en-US", "format": "Markdown", "text": "# ProtoPen 3D Printing Pen Care & Safety Guide (v1.0)\n\nUsing your 3D pen safely.\n\n## Safety Precautions\n\n*   **Nozzle Temperature:** The nozzle tip gets warm enough to melt the low-temperature filament (typically 60-80°C). While much lower than standard 3D printers, **avoid touching the nozzle tip** during or immediately after use to prevent minor burns.\n*   **Filament:** Use ONLY the specified low-temperature, non-toxic filament compatible with this pen. Using standard PLA/ABS filament WILL damage the pen and may release harmful fumes.\n*   **Supervision:** Recommended for ages 8+. Adult supervision is strongly advised, especially for younger users.\n*   **Ventilation:** Use in a well-ventilated area.\n*   **Eye Protection:** While filament cools quickly, consider safety glasses as a precaution against accidental filament flicks towards eyes.\n*   **Battery Safety (Internal):** Follow standard Lithium battery safety (charge correctly, don't damage, etc. - see CS-ANI-001_CSG_v1.0).\n*   **Power Off:** Turn off the pen when not in use. Allow nozzle to cool completely before storing.\n*   **Choking Hazard:** Filament strands and small 3D printed parts can be choking hazards for young children.\n\n## Care Instructions\n\n*   **Cleaning the Nozzle:** If filament builds up around the nozzle tip, allow the pen to cool completely, then gently scrape away excess cooled plastic (avoid scratching the nozzle itself).\n*   **Preventing Clogs:** Follow tips in the User Guide (use correct filament, unload when storing, clean-cut ends).\n*   **Storage:** Store the pen and filament in a cool, dry place. Unload filament from the pen before long-term storage.\n*   **Charging Port:** Keep clean.\n*   **Handling:** Avoid dropping the pen.\n\nFailure to follow safety guidelines may result in minor burns, equipment damage, or other risks."}
{"_id": "CS-3DP-002_QSG_v1.0", "product_id": "CS-3DP-002", "product_name": "MiniForge 3D Printer", "doc_type": "Quick Start Guide", "version": "1.0", "title": "MiniForge 3D Printer Quick Start Guide", "language": "en-US", "format": "Markdown", "text": "# MiniForge 3D Printer Quick Start Guide (v1.0)\n\nStart printing your 3D creations!\n\n## What's in the Box\n\n*   MiniForge 3D Printer (fully assembled)\n*   Removable Build Plate\n*   Power Cable & Adapter\n*   USB Cable (for PC connection)\n*   SD Card (with sample models & software)\n*   Small Starter Spool of PLA Filament\n*   Filament Holder (may need attachment)\n*   Tool Kit (Spatula, Snippers, Nozzle Cleaning Tool)\n*   This Quick Start Guide\n\n## Initial Setup\n\n1.  **Unpacking:** Carefully remove printer and all accessories from packaging. Remove any internal packing material or securing tape from inside the printer.\n2.  **Placement:** Place the printer on a stable, level surface with adequate ventilation around it. Keep away from flammable materials.\n3.  **Attach Filament Holder:** Mount the filament holder onto the printer frame as shown in diagram (if not pre-attached).\n4.  **Install Build Plate:** Ensure the removable build plate is clean and properly seated on the heated bed inside the printer.\n5.  **Connect Power:** Plug the power adapter into the printer and then into a wall outlet. Turn ON the printer using the power switch (usually at the back or side).\n\n## Loading Filament\n\n1.  **Preheat Nozzle:** Use the printer's control panel/screen. Navigate to Prepare/Preheat menu. Select 'Preheat PLA' (or set nozzle temp to ~200-210°C). Wait for nozzle to reach temperature.\n2.  **Prepare Filament Spool:** Place the PLA filament spool onto the holder. Find the loose end of the filament. Cut the end cleanly at an angle.\n3.  **Feed Filament:** Locate the extruder mechanism (where filament enters). Press the extruder lever (if present) to release tension. Insert the filament end into the opening and push it through until it reaches the hotend/nozzle. You may feel it engage.\n4.  **Extrude:** Use the control panel menu (e.g., Prepare > Move Axis > Extruder) to advance the filament slowly, OR gently push filament while holding the extruder lever until you see melted plastic extruding from the nozzle.\n\n## Starting Your First Print (Using SD Card)\n\n1.  **Insert SD Card:** Insert the included SD Card into the printer's SD card slot.\n2.  **Level Bed (Crucial First Step):** Use the control panel menu (e.g., Prepare > Level Bed / Aux Leveling). Follow on-screen prompts. This usually involves moving the nozzle to different corners and adjusting bed height using knobs underneath until a piece of paper just barely drags between nozzle and bed at each point. **Proper bed leveling is essential for successful prints.** Refer to Software User Manual (SUM) for details.\n3.  **Select Model:** Use the control panel. Navigate to Print > Print from SD. Select one of the pre-loaded sample model files (ending in .gcode).\n4.  **Start Print:** Confirm selection. The printer will heat the nozzle and bed (if heated) to target temperatures, then begin printing the object layer by layer.\n\n## During the Print\n\n*   Observe the first layer carefully. It should stick well to the build plate without being squashed too much or being too high up.\n*   The printer operates automatically. Avoid touching moving parts.\n\n## Removing Print\n\n1.  Wait for the print to finish and the nozzle/bed to COOL DOWN significantly.\n2.  Carefully remove the flexible build plate (if applicable).\n3.  Gently flex the plate to pop the print off, or use the provided spatula carefully to pry it loose.\n\n**Safety:** Printer has hot parts (nozzle, bed) and moving components. Adult supervision required. See Safety & Compliance Sheet (SCS) for details."}
{"_id": "CS-3DP-002_SUM_v1.0", "product_id": "CS-3DP-002", "product_name": "MiniForge 3D Printer", "doc_type": "Software User Manual (On-Printer)", "version": "1.0", "title": "MiniForge On-Printer Control Software User Manual", "language": "en-US", "format": "Markdown", "text": "# MiniForge On-Printer Control Software User Manual (v1.0)\n\nNavigating the MiniForge's built-in controls.\n\n## Interface Overview\n\n*(Image: Printer's LCD screen showing main menu)*\n\n*   **Display:** Shows current status (temperatures, print progress), menus, and options.\n*   **Control Knob/Buttons:** Used to navigate menus (turn knob to scroll, press knob/button to select) or dedicated buttons for common actions.\n\n## Main Menu Structure (Typical Example)\n\n*   **Print:**\n    *   *Print from SD:* Browse files on the SD card and start a print.\n    *   *(Print via USB: May be possible if connected to PC running host software)*\n*   **Prepare:**\n    *   *Preheat PLA/ABS:* Quickly heat nozzle/bed to preset temperatures.\n    *   *Preheat Settings:* Manually set target nozzle and bed temperatures.\n    *   *Move Axis:* Manually move X, Y, Z axes or Extruder motor (useful for loading/unloading).\n    *   *Auto Home:* Move all axes to their home/zero positions (using endstop switches).\n    *   *Level Bed / Aux Leveling:* Guided procedure for manually leveling the print bed (CRITICAL STEP - see below).\n    *   *Disable Steppers:* Release motors so axes can be moved by hand (use with caution).\n    *   *Change Filament:* Guided procedure for unloading old and loading new filament.\n*   **Control / Tune:** (Often accessible during a print)\n    *   *Temperature:* Adjust nozzle/bed temperature on-the-fly.\n    *   *Speed:* Adjust overall print speed percentage.\n    *   *Fan Speed:* Adjust part cooling fan speed.\n    *   *Flow Rate:* Adjust filament extrusion multiplier.\n    *   *(Other tuning options: Z-Offset, etc.)*\n*   **Info / Settings:**\n    *   *Version Info:* Display firmware version.\n    *   *Status Screen:* Return to main status display.\n    *   *(Advanced Settings: May include PID tuning, E-steps calibration - for advanced users only)*\n\n## Key Operations\n\n*   **Bed Leveling (Manual/Auxiliary):**\n    1.  Select 'Level Bed' from Prepare menu.\n    2.  Printer homes axes and moves nozzle to first corner.\n    3.  Place a standard piece of paper between nozzle and bed.\n    4.  Adjust the leveling knob under that corner until the paper drags slightly when moved.\n    5.  Use screen prompts to move to next corner(s) and repeat adjustment.\n    6.  Repeat process 1-2 times for fine-tuning. Consistent first layer adhesion depends on good leveling.\n*   **Loading Filament:**\n    1.  Preheat PLA.\n    2.  Prepare filament end.\n    3.  Use 'Move Axis > Extruder' menu to advance filament OR use 'Change Filament' wizard if available.\n*   **Unloading Filament:**\n    1.  Preheat PLA.\n    2.  Use 'Move Axis > Extruder' menu and select negative values to retract filament OR use 'Change Filament' wizard.\n*   **Starting Print from SD:**\n    1.  Insert SD card.\n    2.  Select 'Print from SD'.\n    3.  Choose desired .gcode file.\n    4.  Confirm. Printer heats up and starts.\n*   **Pausing/Stopping Print:** During printing, pressing the control knob/button usually brings up options to Pause Print or Stop Print.\n\nRefer to the Slicing Software Guide (SWG) for preparing your own models for printing."}
{"_id": "CS-3DP-002_SWG_v1.0", "product_id": "CS-3DP-002", "product_name": "MiniForge 3D Printer", "doc_type": "Slicing Software Guide", "version": "1.0", "title": "MiniForge Simplified Slicer Software Guide", "language": "en-US", "format": "Markdown", "text": "# MiniForge Simplified Slicer Software Guide (v1.0)\n\nPreparing your 3D models for printing on the MiniForge.\n\n## What is Slicing?\n\n*   3D printers build objects layer by layer. A 'slicer' is software that takes a 3D model file (like .STL or .OBJ) and cuts it into thin horizontal layers.\n*   It then generates a file (usually `.gcode`) containing specific instructions (movement commands, temperature settings, extrusion amounts) that the MiniForge printer understands.\n\n## Software Installation\n\n1.  Insert the included SD card into your computer OR download the MiniForge Slicer software from the Kinetic Constructs website.\n2.  Run the installer and follow the on-screen prompts.\n\n## Basic Slicer Workflow\n\n*(Screenshot: Slicer software interface showing model loaded on virtual build plate)*\n\n1.  **Load Model:**\n    *   Click 'Load Model' or 'Import' button.\n    *   Browse and select your 3D model file (.STL, .OBJ, .3MF are common formats).\n    *   The model will appear on the virtual build plate in the software.\n2.  **Position & Orient Model:**\n    *   Use software tools (Move, Rotate, Scale) to position the model on the virtual build plate.\n    *   **Orientation is Key:** Rotate the model so the flattest side is on the build plate for best adhesion. Minimize overhangs and the need for supports where possible.\n3.  **Select Print Settings (Simplified Profile):**\n    *   Choose the 'MiniForge PLA - Standard Quality' profile (or similar pre-configured option).\n    *   This automatically sets appropriate layer height, temperatures, speeds, infill, etc. for typical PLA prints on the MiniForge.\n    *   **(Optional - Basic Adjustments):** You might see simple options like:\n        *   *Quality:* (e.g., Fast, Standard, Fine) - Affects layer height.\n        *   *Infill:* (e.g., Low 10%, Medium 20%, High 50%) - Density of internal structure.\n        *   *Supports:* (Checkbox: 'Generate Supports') - Automatically adds temporary structures under overhanging parts of the model. Needed for angles typically > 45-60 degrees.\n        *   *Adhesion:* (Checkbox: 'Add Brim/Raft') - Adds extra material around the base of the model to improve bed adhesion, especially for small parts.\n4.  **Slice the Model:**\n    *   Click the 'Slice' or 'Prepare Print' button.\n    *   The software calculates the layers and generates the toolpath.\n    *   It will often show a preview of the layers and estimate print time and filament usage.\n5.  **Save G-code:**\n    *   Click 'Save G-code' or 'Export'.\n    *   Save the resulting .gcode file directly to the SD card.\n    *   Use a simple, descriptive filename (e.g., `my_model.gcode`).\n6.  **Eject SD Card:** Safely eject the SD card from your computer.\n\n## Transferring to Printer\n\n*   Insert the SD card containing the .gcode file into the MiniForge printer.\n*   Use the printer's control panel to select 'Print from SD' and choose your saved file.\n\n## Where to Get 3D Models\n\n*   **Online Repositories:** Websites like Thingiverse, Printables, MyMiniFactory offer vast libraries of free 3D models (.STL files).\n*   **3D Modeling Software:** Create your own models using kid-friendly software like Tinkercad (web-based, free) or more advanced tools like Blender (free, complex) or Fusion 360 (free for hobbyists/students).\n\n## Advanced Slicing (Brief Mention)\n\n*   Standard slicers (like Ultimaker Cura, PrusaSlicer - both free) offer many more settings (speeds, cooling, retraction, specific support structures, etc.) for fine-tuning prints. Using these requires creating a custom printer profile for the MiniForge based on its specifications (build volume, filament diameter, etc.). This is recommended only for advanced users."}
{"_id": "CS-3DP-002_TMG_v1.1", "product_id": "CS-3DP-002", "product_name": "MiniForge 3D Printer", "doc_type": "Troubleshooting & Maintenance Guide", "version": "1.1", "title": "MiniForge 3D Printer Troubleshooting & Maintenance Guide", "language": "en-US", "format": "Markdown", "text": "# MiniForge 3D Printer Troubleshooting & Maintenance (v1.1)\n\nKeeping your MiniForge printing smoothly.\n\n## Common Print Quality Issues & Solutions\n\n*   **Print Not Sticking to Bed (First Layer Adhesion):**\n    *   **Level the Bed:** MOST COMMON CAUSE. Re-level carefully using the paper method. Ensure nozzle is consistently close across the entire bed.\n    *   **Clean the Build Plate:** Wipe with Isopropyl Alcohol (IPA) or soap and water (check plate material recommendations). Fingerprints/dust prevent adhesion.\n    *   **Adjust Z-Offset (If Available):** Fine-tune nozzle starting height via printer menu (small negative offset brings nozzle closer).\n    *   **Use Bed Adhesion Aid:** Apply glue stick (washable PVA) or specialized 3D printing adhesive spray/sheet.\n    *   **Add Brim/Raft in Slicer:** Increases surface area contact for the first layer.\n    *   **Check Bed Temperature:** Ensure bed temp (if heated) is appropriate for PLA (usually 50-60°C).\n*   **Warping / Corners Lifting:**\n    *   Improve bed adhesion (see above).\n    *   Ensure printer is in a draft-free location. The enclosed design helps, but drafts can still cause uneven cooling.\n    *   Use Brim/Raft in slicer.\n*   **Stringing / Oozing (Fine plastic strings between parts):**\n    *   **Retraction Settings:** May need adjustment in slicer (increase retraction distance/speed - advanced setting). Pre-set profiles should be okay.\n    *   **Nozzle Temperature:** Try slightly lowering nozzle temp (in 5°C increments) within PLA range (190-220°C).\n    *   **Dry Filament:** PLA absorbs moisture over time, worsening stringing. Try fresh/dry filament.\n*   **Layer Shifting (Layers misaligned):**\n    *   Check belt tension on X and Y axes (not too loose, not too tight - check printer manual for specifics).\n    *   Check if pulley set screws on motor shafts are tight.\n    *   Ensure print head or bed can move freely without snagging on wires.\n    *   Printing too fast can cause skipped steps.\n*   **Under-Extrusion / Gaps in Print:**\n    *   **Partial Nozzle Clog:** See 'Nozzle Clogged' below.\n    *   **Extruder Tension:** Ensure extruder gear grips filament correctly (check tension adjustment if available).\n    *   **Filament Tangled on Spool:** Ensure filament feeds smoothly off the spool.\n    *   **Incorrect Filament Diameter Setting in Slicer:** (Should be 1.75mm usually).\n    *   **Printing Temperature Too Low:** Nozzle can't melt filament fast enough.\n*   **Over-Extrusion / Blobs:**\n    *   **Incorrect Flow Rate/E-Steps:** May need calibration (advanced).\n    *   **Printing Temperature Too High:** Filament oozes too much.\n*   **Nozzle Clogged (Filament won't extrude at all):**\n    *   Preheat nozzle slightly higher than usual for PLA (e.g., 220-230°C).\n    *   Try manually pushing filament through.\n    *   Use the nozzle cleaning tool (fine needle) provided - carefully insert into nozzle tip while hot to clear blockage. **CAUTION: HOT!**\n    *   Perform a 'Cold Pull' (advanced technique - research needed).\n    *   May require nozzle disassembly/replacement if severely clogged.\n\n## Printer Hardware Issues\n\n*   **Printer Won't Turn On:** Check power cable connections, wall outlet, power switch. Check fuse if accessible.\n*   **Screen Blank / Unresponsive:** Check screen cable connection to mainboard (requires opening casing - advanced/warranty void risk). Possible board issue.\n*   **Axis Not Moving / Grinding Noise:** Check for obstructions. Check motor connection. Check belt/pulley. Possible faulty motor or driver chip.\n*   **Heating Failure (Nozzle or Bed):** Check thermistor and heater cartridge wiring at the control board (advanced/warranty void risk). Possible component failure.\n\n## Maintenance Schedule\n\n*   **Before Every Print:** Check bed leveling (quick check), ensure build plate is clean.\n*   **Periodically (e.g., every 10-20 print hours):**\n    *   Clean build plate thoroughly.\n    *   Check belt tension.\n    *   Check screw tightness (especially on moving parts like hotend, extruder).\n    *   Clean extruder gear teeth (with small brush).\n    *   Lubricate Z-axis lead screw(s) if applicable (check manual for lubricant type).\n    *   Inspect nozzle for wear/damage.\n*   **As Needed:** Clear nozzle clogs, replace nozzle, dry filament, update firmware.\n\nRefer to Kinetic Constructs support if issues persist beyond basic troubleshooting."}
{"_id": "CS-3DP-002_SCS_v1.0", "product_id": "CS-3DP-002", "product_name": "MiniForge 3D Printer", "doc_type": "Safety & Compliance Sheet", "version": "1.0", "title": "MiniForge 3D Printer Safety & Compliance Sheet", "language": "en-US", "format": "Markdown", "text": "# MiniForge 3D Printer Safety & Compliance (v1.0)\n\n**WARNING: Contains Hot Parts, Moving Components, and involves High Temperatures. Operate with caution.**\n**Recommended Age: 10+** Close adult supervision REQUIRED, especially during setup, operation, and maintenance.\n\n## Electrical Safety\n\n*   Use ONLY the provided power cable and adapter certified for your region.\n*   Plug into a properly grounded wall outlet. Do not use damaged cords.\n*   Keep liquids away from the printer and power supply.\n*   Turn OFF and UNPLUG the printer before performing any internal maintenance or cleaning.\n*   Do not attempt to modify wiring or electrical components unless qualified.\n\n## Burn Hazard\n\n*   **HOTEND / NOZZLE:** Reaches temperatures of 190-230°C+ during operation. **DO NOT TOUCH** the nozzle or heater block. Allow significant time (10+ minutes) for cooling after use before touching.\n*   **HEATED BED:** Can reach 50-70°C+. Avoid prolonged contact.\n*   Keep flammable materials away from the printer during operation.\n\n## Mechanical Safety\n\n*   **MOVING PARTS:** Keep hands, fingers, hair, loose clothing, and tools AWAY from moving axes (X, Y, Z), belts, and print head during operation.\n*   **PINCH POINTS:** Be aware of potential pinch points between moving parts and the frame.\n*   **ENCLOSURE:** While enclosed, do not reach inside while the printer is running.\n\n## Operational Safety\n\n*   **VENTILATION:** Operate in a well-ventilated room. While PLA filament is generally considered low-fume, melting plastics can still release particles and VOCs.\n*   **UNATTENDED OPERATION:** While possible, it is NOT recommended to leave the printer running completely unattended for long periods, especially for beginners. Check on prints periodically.\n*   **FIRST LAYER:** Always monitor the first layer closely to ensure proper adhesion and prevent print failures (e.g., spaghetti monster).\n*   **PRINT REMOVAL:** Wait for printer parts (nozzle, bed) to cool before removing prints. Use the provided spatula carefully to avoid damaging the print or the build surface, and avoid cutting yourself.\n*   **FILAMENT:** Use only recommended filament types (PLA for this model). Using incompatible materials can damage the printer and potentially release harmful fumes.\n\n## Fire Safety\n\n*   In the unlikely event of a fire, unplug the printer ONLY if safe to do so. Use a Class ABC or CO2 fire extinguisher. Do NOT use water on electrical fires.\n*   Consider having a smoke detector near the printer.\n\n## Compliance Information (Example)\n\n*   FCC Part 15 compliant.\n*   CE Mark (Conforms to Low Voltage Directive, EMC Directive, RoHS).\n*   Power Supply separately certified (UL, CE, etc.).\n\n**Read all documentation carefully before operation. Prioritize safety at all times.**\nStore this sheet for future reference.\nKinetic Constructs - Building Tomorrow's Play."}
{"_id": "CS-MUS-001_QSG_v1.0", "product_id": "CS-MUS-001", "product_name": "BeatBuilder Music Station", "doc_type": "Quick Start Guide", "version": "1.0", "title": "BeatBuilder Music Station Quick Start Guide", "language": "en-US", "format": "Markdown", "text": "# BeatBuilder Music Station Quick Start Guide (v1.0)\n\nStart making your own beats!\n\n## What's in the Box\n\n*   BeatBuilder Hardware Controller (Pads & Knobs)\n*   USB Cable\n*   Software Installation Guide / Card (with download link/key)\n*   This Quick Start Guide\n\n## Software Installation\n\n1.  Go to the Kinetic Constructs software download website mentioned on the included card/guide.\n2.  Download the 'BeatBuilder Studio' software installer for your computer (Windows/Mac).\n3.  Run the installer and follow the on-screen prompts.\n4.  You may need to enter a license key (from the card) during installation.\n\n## Connecting the Hardware\n\n1.  Connect the small end of the USB cable to the port on the BeatBuilder controller.\n2.  Connect the large end to a USB port on your computer.\n3.  The hardware is powered by USB. Lights on the controller may turn on.\n\n## Launching the Software\n\n1.  Ensure the BeatBuilder hardware is connected BEFORE launching the software.\n2.  Double-click the 'BeatBuilder Studio' icon on your computer to start the program.\n3.  The software should automatically detect the connected hardware.\n\n## Making Your First Beat\n\n1.  **Explore Sounds:** The software usually loads a default drum kit. Tap the pads on the hardware controller - each pad should trigger a different drum sound (kick, snare, hi-hat, etc.) played through your computer's speakers/headphones.\n2.  **Record a Pattern:**\n    *   Find the 'Record' button in the software interface.\n    *   Set a tempo (BPM - Beats Per Minute).\n    *   Press 'Play' or 'Start'. A metronome click may sound.\n    *   Press the Record button.\n    *   Tap the pads in time with the metronome to create a simple beat (e.g., Kick on 1 & 3, Snare on 2 & 4, Hi-hats continuously).\n    *   Press Record again (or Stop) to finish recording the pattern (usually loops automatically).\n3.  **Playback:** Press 'Play' to hear your recorded beat loop.\n4.  **Experiment:** Try adding more sounds, changing the tempo, or using the knobs on the controller (which likely control effects or sample parameters - see SUM).\n\nFor detailed software instructions, see the Software User Manual (CS-MUS-001_SUM_v1.0)."}
{"_id": "CS-MUS-001_SUM_v1.0", "product_id": "CS-MUS-001", "product_name": "BeatBuilder Music Station", "doc_type": "Software User Manual", "version": "1.0", "title": "BeatBuilder Studio Software User Manual", "language": "en-US", "format": "Markdown", "text": "# BeatBuilder Studio Software User Manual (v1.0)\n\nProduce awesome beats and loops.\n\n## Interface Overview\n\n*(Screenshot: BeatBuilder Studio software interface with key sections labelled)*\n\n*   **Pad Grid / Drum Machine:** Visual representation of the hardware pads. Clicking pads here also triggers sounds. Shows which sound is assigned to each pad.\n*   **Sound Library / Browser:** Area to browse and load different drum kits (Rock, Hip Hop, Electronic) or individual samples (kicks, snares, melodies, FX).\n*   **Sequencer / Piano Roll:** Shows the recorded pattern visually. Allows editing notes (adding, deleting, moving, changing velocity).\n*   **Transport Controls:** Play, Stop, Record, Loop toggle, Tempo (BPM) setting, Metronome toggle.\n*   **Mixer (Simple):** Basic volume faders for different tracks or pads.\n*   **Effects Rack (Simple):** Area to apply basic effects like Reverb, Delay, Filter to sounds or the overall mix. Often linked to hardware knobs.\n*   **Pattern/Song Mode:** Switch between working on individual looping patterns and arranging patterns into a longer song structure.\n\n## Loading Sounds\n\n1.  Open the Sound Library/Browser.\n2.  Select a drum kit category or individual sound type.\n3.  Drag a kit name onto the Pad Grid area to load the entire kit.\n4.  OR drag an individual sound sample (e.g., `kick_drum_heavy.wav`) onto a specific pad in the Pad Grid to assign it.\n\n## Recording Patterns\n\n*   **Real-time Recording:**\n    1.  Select desired pattern slot.\n    2.  Set Tempo (BPM).\n    3.  Enable Metronome (optional but recommended).\n    4.  Press Record, then Play.\n    5.  Tap pads on the hardware controller in time. Your hits are recorded into the sequencer.\n    6.  Press Stop or Record again.\n*   **Step Sequencing:**\n    1.  Select a sound (e.g., click the Kick Drum pad representation).\n    2.  In the Sequencer view (often a grid), click on the steps (e.g., 1, 5, 9, 13 for a 4/4 beat) where you want that sound to play.\n    3.  Select another sound (e.g., Snare) and click its steps (e.g., 5, 13).\n    4.  Press Play to hear the programmed beat.\n\n## Editing Patterns\n\n*   Use the Sequencer/Piano Roll view.\n*   Click to add/delete notes.\n*   Drag notes to change timing.\n*   Adjust velocity (loudness) of notes if supported.\n*   Change pattern length (e.g., 1 bar, 2 bars).\n\n## Using Knobs & Effects\n\n*   Turn the physical knobs on the BeatBuilder controller.\n*   Observe which parameters change in the software interface (often linked to selected sound or effects rack).\n*   **Common Knob Assignments:**\n    *   *Filter Cutoff:* Makes sound duller or brighter.\n    *   *Reverb Amount:* Adds echo/space.\n    *   *Delay Time/Feedback:* Adds repeating echoes.\n    *   *Sample Pitch/Tune:* Changes the pitch of the selected sound.\n*   Experiment to see how knobs affect the sound.\n\n## Arranging a Song (Simple)\n\n1.  Create several different patterns (e.g., Intro Beat, Verse Beat, Chorus Beat).\n2.  Switch to 'Song Mode' (if available).\n3.  Drag or sequence your created patterns onto a song timeline to build a full track structure (e.g., Intro -> Verse -> Chorus -> Verse -> Outro).\n\n## Saving & Exporting\n\n*   **Save Project:** Use 'File > Save Project' frequently to save your entire session (patterns, sound assignments, arrangement).\n*   **Export Audio:** Use 'File > Export Audio' or 'Render'.\n    *   Choose format (WAV for quality, MP3 for sharing).\n    *   Select export range (current pattern or entire song arrangement).\n    *   Click Export to create an audio file you can listen to outside the software."}
{"_id": "CS-MUS-001_CPIG_v1.0", "product_id": "CS-MUS-001", "product_name": "BeatBuilder Music Station", "doc_type": "Creative Project Ideas Guide", "version": "1.0", "title": "BeatBuilder Creative Project Ideas", "language": "en-US", "format": "Markdown", "text": "# BeatBuilder Creative Project Ideas (v1.0)\n\nIdeas to get your musical creativity flowing!\n\n## Project 1: Basic 4/4 Beat\n\n*   **Concept:** Create a standard rock/pop beat.\n*   **Steps:**\n    1.  Set Tempo to 120 BPM.\n    2.  Load a standard drum kit.\n    3.  Use Step Sequencer:\n        *   Kick Drum on steps 1, 5, 9, 13.\n        *   Snare Drum on steps 5, 13.\n        *   Closed Hi-Hat on steps 1, 3, 5, 7, 9, 11, 13, 15.\n    4.  Play the loop. Experiment with adding an Open Hi-Hat on step 7 or 15.\n*   **Challenge:** Try recording this beat in real-time using the pads.\n\n## Project 2: Hip Hop Groove\n\n*   **Concept:** Create a laid-back hip hop beat.\n*   **Steps:**\n    1.  Set Tempo around 90 BPM.\n    2.  Load a hip hop or electronic kit (look for deep kicks, snappy snares).\n    3.  Record or sequence a pattern focusing on a strong kick and snare, maybe with off-beat hi-hats or a clap sound.\n    4.  Experiment with the 'Swing' or 'Shuffle' setting in the software (if available) to give it a less robotic feel.\n*   **Challenge:** Find a simple bass line sample in the library and trigger it on a pad to match your beat.\n\n## Project 3: Electronic Dance Loop\n\n*   **Concept:** Build an energetic electronic beat.\n*   **Steps:**\n    1.  Set Tempo to 130-140 BPM.\n    2.  Load an electronic or techno kit.\n    3.  Create a driving 'four-on-the-floor' kick pattern (Kick on 1, 5, 9, 13).\n    4.  Add syncopated hi-hats and claps/snares.\n    5.  Use the knobs! Automate a filter sweep on the hi-hats or add delay to a percussion sound.\n*   **Challenge:** Create two variations of the beat (Pattern A, Pattern B) and switch between them.\n\n## Project 4: Sound Effect Story\n\n*   **Concept:** Use sound effects and percussion to tell a mini-story.\n*   **Steps:**\n    1.  Load various sound effect samples onto the pads (e.g., footsteps, door creak, crash, spooky synth sound, animal noise).\n    2.  Record a sequence triggering the sounds in an order that tells a simple story.\n    3.  Use knobs to add reverb or filter effects to enhance the mood.\n\n## Project 5: Layering Melodies (Simple)\n\n*   **Concept:** Add simple melodic elements over your beat.\n*   **Steps:**\n    1.  Create a basic beat pattern.\n    2.  Find simple melodic samples in the library (e.g., single notes, short synth stabs, bass tones).\n    3.  Assign these sounds to unused pads.\n    4.  Create a new pattern.\n    5.  Record or step-sequence a simple melody using the melodic pads over your beat.\n*   **Challenge:** Try pitching the melodic samples up or down using the knobs.\n\n## General Tips\n\n*   **Start Simple:** Don't try to use all sounds at once.\n*   **Listen:** Pay attention to how different rhythms feel.\n*   **Experiment with Knobs:** Effects can drastically change a sound.\n*   **Save Often:** Save your projects regularly.\n*   **Have Fun!** There's no right or wrong way to be creative."}
{"_id": "CS-MUS-001_TSF_v1.0", "product_id": "CS-MUS-001", "product_name": "BeatBuilder Music Station", "doc_type": "Troubleshooting & Support FAQ", "version": "1.0", "title": "BeatBuilder Troubleshooting & Support FAQ", "language": "en-US", "format": "Markdown", "text": "# BeatBuilder Troubleshooting & Support FAQ (v1.0)\n\nSolving common BeatBuilder issues.\n\n## Hardware Issues\n\n*   **Controller Not Detected by Software:**\n    *   Ensure controller is plugged into computer's USB port BEFORE launching software.\n    *   Try a different USB port and USB cable.\n    *   Check if lights turn on on the controller when plugged in.\n    *   Restart computer and relaunch software.\n    *   Check if drivers are needed/installed correctly (usually class-compliant, but check Kinetic Constructs website).\n*   **Pads Not Triggering Sounds:**\n    *   Verify controller is detected by software.\n    *   Ensure a sound or kit is loaded onto the pads in the software interface.\n    *   Check if MIDI mapping is correct (software settings might have MIDI input configuration - ensure BeatBuilder is selected and mapped).\n    *   Pad sensitivity settings (if available in software) might be too low.\n    *   Possible hardware fault with pads or controller.\n*   **Knobs Not Affecting Sound:**\n    *   Verify controller is detected.\n    *   Ensure knobs are assigned to parameters in the software (this is usually automatic but check settings).\n    *   Make sure you have a sound selected or an effect active that the knob is supposed to control.\n\n## Software Issues\n\n*   **Software Crashes or Freezes:**\n    *   Ensure computer meets minimum system requirements for the software.\n    *   Close other unnecessary applications running in the background.\n    *   Check for software updates for BeatBuilder Studio.\n    *   Update computer operating system and audio drivers.\n    *   Try reinstalling the BeatBuilder Studio software.\n*   **No Sound Output:**\n    *   Check computer's main volume and ensure speakers/headphones are properly connected and selected as the output device in BOTH the computer's sound settings AND the BeatBuilder Studio software's audio settings.\n    *   Ensure track/pad volume faders in the software mixer are turned up.\n    *   Check if 'Mute' or 'Solo' buttons are accidentally engaged in the software.\n*   **Latency (Delay between hitting pad and hearing sound):**\n    *   Increase 'Buffer Size' or 'Sample Rate' in the BeatBuilder Studio audio settings (may require restarting software). Larger buffer = more latency but less CPU load; smaller buffer = less latency but more CPU load.\n    *   Using a dedicated audio interface with ASIO drivers (Windows) or Core Audio (Mac) usually provides lower latency than built-in sound cards.\n    *   Close other demanding applications.\n*   **Cannot Save/Export Project:**\n    *   Ensure you have write permissions for the chosen save location.\n    *   Check available disk space on your computer.\n    *   Try saving with a different name or to a different location.\n    *   Possible software bug - check for updates.\n\n## Contacting Support\n\n*   Visit Kinetic Constructs support website or email support with model number (CS-MUS-001), software version, computer OS, and problem description."}
{"_id": "CS-MUS-001_CSG_v1.0", "product_id": "CS-MUS-001", "product_name": "BeatBuilder Music Station", "doc_type": "Care & Safety Guide", "version": "1.0", "title": "BeatBuilder Music Station Care & Safety Guide", "language": "en-US", "format": "Markdown", "text": "# BeatBuilder Music Station Care & Safety Guide (v1.0)\n\nTaking care of your music creation hardware.\n\n## Care Instructions\n\n*   **Cleaning:** Wipe the controller surface, pads, and knobs with a soft, dry cloth. Avoid liquids and sprays.\n*   **USB Port:** Keep the USB port on the controller clean and free of dust. Connect and disconnect the cable gently.\n*   **Pads:** Avoid hitting pads with excessive force or sharp objects.\n*   **Knobs:** Turn knobs smoothly; do not force them past their rotation limits.\n*   **Storage:** Store the controller in a clean, dry place. Avoid extreme temperatures. Cover to protect from dust when not in use.\n*   **Transport:** If transporting, use a padded bag or case if possible to protect knobs and pads.\n\n## Safety Precautions\n\n*   **Electrical Safety:** The device is USB powered (low voltage). Use a standard computer USB port or a certified powered USB hub. Do not use damaged USB cables.\n*   **Hearing Safety:** Be mindful of volume levels when using headphones connected to your computer. Listening at high volumes for extended periods can damage hearing.\n*   **Repetitive Strain:** Take breaks during long music creation sessions to avoid wrist or finger strain from tapping pads or using the computer mouse/keyboard.\n*   **Liquids:** Keep drinks and other liquids away from the controller and your computer to prevent spills and electrical damage.\n\nThis device is intended for creative expression and is generally safe when used as directed."}
{"_id": "CS-MUS-002_QSG_v1.0", "product_id": "CS-MUS-002", "product_name": "SoundScape Mixer Console", "doc_type": "Quick Start Guide", "version": "1.0", "title": "SoundScape Mixer Console Quick Start Guide", "language": "en-US", "format": "Markdown", "text": "# SoundScape Mixer Console Quick Start Guide (v1.0)\n\nStart mixing like a pro (beginner)!\n\n## What's in the Box\n\n*   SoundScape Mixer Console Hardware\n*   USB Cable\n*   Power Adapter (if required, may be USB powered)\n*   Software Installation Guide / Card\n*   This Quick Start Guide\n\n## Software Installation\n\n1.  Download and install the 'SoundScape Studio' software from the Kinetic Constructs website (see included card).\n2.  Follow installation prompts. Enter license key if required.\n3.  Install any necessary hardware drivers if prompted (may be needed for multi-channel audio).\n\n## Connecting the Hardware\n\n1.  Connect the USB cable from the Mixer Console to your computer.\n2.  If a separate Power Adapter is included, connect it to the mixer and a wall outlet.\n3.  Power ON the mixer using its power switch.\n\n## Audio Connections\n\n*   **Output:** Connect your computer speakers or headphones to your COMPUTER'S audio output jack, OR potentially to the Mixer's dedicated Headphone/Monitor output jack (check mixer features).\n*   **Inputs:**\n    *   **Microphone:** Connect a microphone (check if XLR or 1/4\" jack supported, phantom power switch if condenser mic) to a designated Mic Input channel on the mixer.\n    *   **Instruments/Line Sources:** Connect keyboards, synths, or other audio players to Line Input channels (usually 1/4\" jacks).\n    *   **USB Audio:** The mixer acts as a USB audio interface. Sounds from the computer (e.g., from BeatBuilder Studio or other apps) can often be routed through the mixer software/hardware channels.\n\n## Launching the Software\n\n1.  Ensure Mixer hardware is connected and powered ON.\n2.  Launch the 'SoundScape Studio' software.\n3.  **Audio Settings (IMPORTANT):** Go to the software's Audio Settings/Preferences. Select the 'SoundScape Mixer' (or similar name) as BOTH the Audio Input Device and Audio Output Device. This routes audio through the hardware. Adjust buffer size if needed for latency.\n\n## Basic Mixing\n\n1.  **Input Gain:** Speak into the microphone or play the instrument connected to Channel 1. Adjust the 'Gain' or 'Trim' knob for that channel until the level meter in the software (or on the hardware if present) shows a strong signal without peaking into the red (clipping/distortion).\n2.  **Channel Fader:** Raise the volume fader for Channel 1 on the hardware/software.\n3.  **Main Output Fader:** Raise the Main Mix output fader.\n4.  You should now hear the sound from Channel 1 through your speakers/headphones.\n5.  Repeat Gain/Fader steps for other connected inputs or software audio tracks.\n6.  Use channel faders to balance the volume levels of different sounds.\n\nRefer to the Software User Manual (CS-MUS-002_SUM_v1.1) for EQ, Effects, and Recording details."}
{"_id": "CS-MUS-002_SUM_v1.1", "product_id": "CS-MUS-002", "product_name": "SoundScape Mixer Console", "doc_type": "Software User Manual", "version": "1.1", "title": "SoundScape Studio Software User Manual", "language": "en-US", "format": "Markdown", "text": "# SoundScape Studio Software User Manual (v1.1)\n\nCrafting your sound with the SoundScape Mixer.\n\n## Interface Overview\n\n*(Screenshot: SoundScape Studio software showing mixer channels, effects, transport)*\n\n*   **Mixer View:** Virtual representation of the hardware mixer channels.\n    *   **Input Gain/Trim:** Controls signal level coming into the channel.\n    *   **EQ Section (Basic):** Knobs/Sliders for High, Mid, Low frequency adjustments (Treble/Bass).\n    *   **FX Send Knob:** Controls how much of the channel's signal is sent to the effects processor.\n    *   **Pan Knob:** Positions the sound in the stereo field (Left/Right).\n    *   **Channel Fader:** Controls the volume level of the channel in the main mix.\n    *   **Mute/Solo Buttons:** Silence the channel or listen to it exclusively.\n*   **Main Mix Section:** Master fader controlling overall output volume. Main level meters.\n*   **Effects Rack:** Select and adjust parameters for built-in effects (Reverb, Delay, Chorus, etc.).\n*   **Audio Tracks:** If the software supports recording, displays recorded audio waveforms.\n*   **Transport Controls:** Play, Stop, Record (for recording inputs into the software).\n*   **Audio Settings:** Configure audio interface (SoundScape Mixer), sample rate, buffer size.\n\n## Setting Input Levels (Gain Staging)\n\n*   Proper gain staging is crucial to avoid distortion and noise.\n*   For each input channel (mic, instrument, software track):\n    1.  Make sound at the LOUDEST level it will reach during the performance/recording.\n    2.  Adjust the Input Gain/Trim knob so the channel's level meter peaks in the yellow/orange range, but RARELY or NEVER hits the red (clipping).\n    3.  Keep channel fader down initially while setting gain.\n    4.  Once gain is set, use the Channel Fader to mix the sound into the main output at the desired volume.\n\n## Using EQ (Equalization)\n\n*   EQ adjusts the tonal balance of a sound.\n*   **High Knob:** Boosts/cuts high frequencies (makes sound brighter or duller).\n*   **Mid Knob (if present):** Boosts/cuts mid-range frequencies (affects presence, vocals).\n*   **Low Knob:** Boosts/cuts bass frequencies (makes sound fuller or thinner).\n*   **Tips:**\n    *   Use EQ subtly. Small cuts are often better than big boosts.\n    *   Cut unwanted frequencies (e.g., low rumble on a vocal mic) rather than boosting everything else.\n    *   Listen to how EQ changes affect the sound in the context of the whole mix.\n\n## Using Effects (FX)\n\n1.  **Select Effect:** Choose an effect (e.g., Reverb) in the Effects Rack.\n2.  **Adjust Effect Parameters:** Set reverb time, delay feedback, etc., in the rack.\n3.  **Use FX Send Knobs:** On each channel you want to apply the effect to, turn up the 'FX Send' knob. This sends a copy of that channel's signal to the effect.\n4.  **Adjust FX Return Level:** There's usually a master 'FX Return' fader or knob that controls how much of the processed effect signal is blended back into the main mix.\n\n## Recording Audio\n\n*   If software supports multi-track recording:\n    1.  Set input gain correctly for the channel you want to record.\n    2.  'Arm' the track for recording in the software (usually a Record [R] button on the track).\n    3.  Press the main Record button in the transport controls, then Play.\n    4.  Perform/sing into the armed input.\n    5.  Press Stop when finished.\n    6.  An audio waveform should appear on the track.\n\n## Saving and Exporting\n\n*   **Save Project:** Save the entire mixer state and recorded audio.\n*   **Export Mixdown:** Render the final Main Mix output to an audio file (WAV/MP3)."}
{"_id": "CS-MUS-002_CPIG_v1.0", "product_id": "CS-MUS-002", "product_name": "SoundScape Mixer Console", "doc_type": "Creative Project Ideas Guide", "version": "1.0", "title": "SoundScape Mixer Creative Project Ideas", "language": "en-US", "format": "Markdown", "text": "# SoundScape Mixer Creative Project Ideas (v1.0)\n\nExplore the possibilities of sound mixing.\n\n## Project 1: Podcast / Voiceover Recording\n\n*   **Concept:** Record clear voice audio.\n*   **Steps:**\n    1.  Connect a microphone to a Mic Input channel.\n    2.  Set Gain correctly to avoid clipping.\n    3.  Use Low Cut/High Pass Filter (if available on channel) to reduce rumble/pops.\n    4.  Use EQ subtly: Maybe a slight boost in Highs for clarity, or a cut in Low-Mids to reduce boxiness.\n    5.  Record the voice onto a track in the software.\n    6.  Add intro/outro music on another software track and balance levels using faders.\n*   **Pro Tip:** Use headphones while recording to monitor sound without feedback.\n\n## Project 2: Mixing a BeatBuilder Track\n\n*   **Concept:** Take a beat made with BeatBuilder (or other source) and improve the mix.\n*   **Steps:**\n    1.  Export individual tracks (Kick, Snare, Hats, Melody) from BeatBuilder if possible, OR route BeatBuilder audio into separate channels in SoundScape Studio (may require virtual audio cables or specific routing).\n    2.  Balance Levels: Use faders to make sure all elements are heard clearly. Kick and Snare are usually prominent.\n    3.  Use Pan Knobs: Pan hi-hats slightly left/right, maybe a percussion sound wider.\n    4.  Use EQ:\n        *   Cut low frequencies from Hi-Hats/Cymbals.\n        *   Maybe boost punch frequencies on Kick/Snare.\n        *   Ensure bassline doesn't clash with Kick drum (cut lows on one if needed).\n    5.  Add Effects: Send Snare to a short Reverb. Send Melody to a Delay.\n*   **Pro Tip:** Compare your mix to professional tracks in the same genre (reference mixing).\n\n## Project 3: Live Jam Session Mix\n\n*   **Concept:** Mix multiple live inputs simultaneously.\n*   **Steps:**\n    1.  Connect Mic for vocals, Keyboard to Line In 1, BeatBuilder output to Line In 2.\n    2.  Set Gain for each input individually.\n    3.  Balance levels using faders.\n    4.  Use EQ on each channel as needed (e.g., cut lows on keyboard if interfering with vocals).\n    5.  Add Reverb to vocals using FX Send.\n    6.  Pan keyboard slightly left, maybe BeatBuilder slightly right.\n    7.  Adjust Main Mix fader for overall output level.\n\n## Project 4: Sound Design with Effects\n\n*   **Concept:** Create interesting sounds by processing simple inputs with effects.\n*   **Steps:**\n    1.  Connect a simple sound source (e.g., tap on a microphone, play a single synth note).\n    2.  Send the signal heavily to an effect like Delay.\n    3.  Adjust Delay Time and Feedback to create rhythmic echoes or long washes of sound.\n    4.  Try sending the Delay output back into another effect (if routing allows) like a Filter or Chorus.\n    5.  Experiment with extreme EQ settings combined with effects.\n\n## General Tips\n\n*   **Listen Carefully:** Train your ears to hear differences in volume, tone (EQ), and space (Reverb/Delay).\n*   **'A/B' Comparisons:** Use Mute/Solo buttons or bypass EQ/Effects to compare the sound with and without processing.\n*   **Less is More:** Often, subtle adjustments have the biggest impact.\n*   **Gain Staging Matters:** Start with good input levels."}
{"_id": "CS-MUS-002_TSF_v1.0", "product_id": "CS-MUS-002", "product_name": "SoundScape Mixer Console", "doc_type": "Troubleshooting & Support FAQ", "version": "1.0", "title": "SoundScape Mixer Troubleshooting & Support FAQ", "language": "en-US", "format": "Markdown", "text": "# SoundScape Mixer Troubleshooting & Support FAQ (v1.0)\n\nResolving audio mixing issues.\n\n## Hardware & Connection Issues\n\n*   **Mixer Not Detected by Computer/Software:**\n    *   Ensure mixer is powered ON and connected via USB.\n    *   Try different USB port/cable.\n    *   Install/reinstall necessary drivers for the mixer.\n    *   Restart computer and mixer.\n    *   Check computer's Device Manager (Windows) or System Information (Mac) to see if hardware is recognized.\n*   **No Sound from Specific Input Channel:**\n    *   Check cable connection from source (mic/instrument) to mixer input jack.\n    *   Verify correct input type is used (Mic vs Line).\n    *   Turn up Input Gain/Trim knob for that channel. Check for signal on meter.\n    *   Ensure channel fader is up and channel is not Muted.\n    *   Ensure Main Mix fader is up.\n    *   Try the source in a different channel to rule out channel fault.\n*   **Distorted Sound / Clipping:**\n    *   Input Gain/Trim is set too high. Reduce gain until signal peaks below red on the meter.\n    *   Channel fader or Main Mix fader might be too high, causing clipping at the output stage.\n*   **Hum or Buzzing Noise:**\n    *   **Ground Loop:** Common when connecting multiple pieces of gear plugged into different outlets. Try plugging everything into the same power strip. Consider using a ground loop isolator.\n    *   **Bad Cables:** Try swapping audio cables.\n    *   **Interference:** Keep audio cables away from power cables and electronic devices (monitors, phones).\n    *   **Microphone Issues:** If using condenser mic, ensure Phantom Power (+48V) is ON (if mixer supports it). If using dynamic mic, ensure Phantom Power is OFF.\n*   **Knobs/Faders Scratchy or Intermittent:**\n    *   Dust/dirt in the potentiometer/fader. Try rapidly moving the knob/fader back and forth several times to dislodge dirt (power off first recommended). If persists, may need cleaning spray (contact cleaner - use carefully) or replacement.\n\n## Software & Audio Routing Issues\n\n*   **No Sound from Computer / Software Playback:**\n    *   Check Audio Settings in SoundScape Studio (or other DAW): Ensure SoundScape Mixer is selected as the OUTPUT device.\n    *   Check computer's main sound output settings: Ensure SoundScape Mixer is selected there too (or audio is routed correctly).\n    *   Ensure the software track playing back is routed to the Main Mix output and its fader is up.\n*   **Cannot Record Input into Software:**\n    *   Check Audio Settings: Ensure SoundScape Mixer is selected as the INPUT device.\n    *   Ensure the correct input channel is selected/armed for recording on the software track.\n    *   Check input gain on the hardware channel.\n*   **High Latency (Delay):**\n    *   Adjust Buffer Size in software audio settings (lower buffer = lower latency, higher CPU).\n    *   Ensure correct/updated drivers are installed for the mixer.\n    *   Close unnecessary background applications on computer.\n\n## Contacting Support\n\n*   Visit Kinetic Constructs support with model (CS-MUS-002), software version, OS, and description of the problem."}
{"_id": "CS-MUS-002_CSG_v1.0", "product_id": "CS-MUS-002", "product_name": "SoundScape Mixer Console", "doc_type": "Care & Safety Guide", "version": "1.0", "title": "SoundScape Mixer Console Care & Safety Guide", "language": "en-US", "format": "Markdown", "text": "# SoundScape Mixer Console Care & Safety Guide (v1.0)\n\nKeep your mixer in top condition.\n\n## Care Instructions\n\n*   **Cleaning:** Wipe surfaces, knobs, and faders gently with a soft, dry cloth. For stubborn grime, use a slightly damp cloth (ensure power is OFF and unplugged). Avoid spraying cleaners directly onto the unit.\n*   **Dust:** Keep mixer covered when not in use to prevent dust buildup in faders and jacks.\n*   **Connections:** Plug and unplug cables gently. Avoid excessive strain on jacks.\n*   **Faders & Knobs:** Operate smoothly. Avoid forcing them.\n*   **Ventilation:** Ensure ventilation openings on the mixer are not blocked.\n*   **Storage:** Store in a cool, dry place away from extreme temperatures and humidity.\n\n## Safety Precautions\n\n*   **Electrical Safety:**\n    *   Use only the specified power adapter (if applicable) or USB connection.\n    *   Ensure proper grounding.\n    *   Do not expose to water or liquids.\n    *   Unplug during thunderstorms or when unused for long periods.\n    *   Do not open the casing; no user-serviceable parts inside (risk of electric shock).\n*   **Hearing Safety:** Be extremely cautious with volume levels, especially when using headphones connected directly to the mixer's headphone output. Start with levels low and increase gradually. Prolonged exposure to high volume can cause permanent hearing damage.\n*   **Phantom Power (+48V):** If your mixer has phantom power for condenser microphones:\n    *   Only enable +48V for microphones that require it (condenser mics).\n    *   DO NOT enable +48V for dynamic mics, ribbon mics (can damage them!), or line level sources.\n    *   Connect/disconnect mics BEFORE enabling/disabling phantom power if possible.\n*   **Trip Hazard:** Keep cables tidy and routed safely to avoid tripping.\n\nThis device handles audio signals and power; follow standard electronic equipment safety practices."}
{"_id": "CS-VID-001_QSG_v1.0", "product_id": "CS-VID-001", "product_name": "StoryReel Video Editor Kit", "doc_type": "Quick Start Guide", "version": "1.0", "title": "StoryReel Video Editor Kit Quick Start Guide", "language": "en-US", "format": "Markdown", "text": "# StoryReel Video Editor Kit Quick Start Guide (v1.0)\n\nStart creating your own movies!\n\n## What's in the Box\n\n*   Foldable Green Screen Backdrop\n*   Clip-on Lens Kit (e.g., Wide Angle, Macro - for smartphone/tablet)\n*   Smartphone/Tablet Stand (Simple)\n*   App Download Card (for StoryReel Editor App)\n*   This Quick Start Guide\n\n## Setting Up\n\n1.  **Green Screen:** Unfold the green screen backdrop and set it up behind the area where you will be filming. Ensure it's smooth and well-lit (avoid shadows).\n2.  **Phone/Tablet:** Place your smartphone or tablet securely in the stand, facing the green screen.\n3.  **Lens (Optional):** Choose a lens from the kit (e.g., wide angle for broader shots) and clip it carefully over your device's main camera lens.\n\n## App Installation & Setup\n\n1.  Use the App Download Card to find and install the 'StoryReel Editor' app from your device's app store (iOS/Android).\n2.  Launch the app. Grant camera and microphone permissions when prompted.\n\n## Filming with Green Screen\n\n1.  **Open App Camera:** Use the camera function within the StoryReel app.\n2.  **Position Subject:** Place your actor or objects in front of the green screen.\n3.  **Lighting:** Ensure the green screen AND your subject are evenly lit. Good lighting is key for the green screen effect.\n4.  **Record:** Hit the record button in the app to capture your video clip.\n5.  **Avoid Green:** Try not to have your subject wear green clothing, as it will also be replaced!\n\n## Basic Editing (Overview)\n\n1.  **Import Clips:** Import the video clips you recorded into the app's editor timeline.\n2.  **Green Screen Effect (Chroma Key):** Select a clip filmed with the green screen. Find the 'Chroma Key' or 'Green Screen' effect in the app. Use the tool to select the green color. The app should make the green areas transparent.\n3.  **Add Background:** Import a photo or video to place 'behind' your green screen footage on a lower track/layer.\n4.  **Trim & Arrange:** Cut unwanted parts of clips and arrange them in order on the timeline.\n5.  **Add Titles & Music:** Use app tools to add text overlays and background music.\n6.  **Export:** Save your finished video!\n\nFor detailed app instructions, see the App User Guide (CS-VID-001_AUG_v1.0)."}
{"_id": "CS-VID-001_AUG_v1.0", "product_id": "CS-VID-001", "product_name": "StoryReel Video Editor Kit", "doc_type": "App User Guide", "version": "1.0", "title": "StoryReel Editor App User Guide", "language": "en-US", "format": "Markdown", "text": "# StoryReel Editor App User Guide (v1.0)\n\nEditing your videos made easy!\n\n## Main Interface\n\n*(Screenshot: App editor interface showing timeline, preview window, tool buttons)*\n\n*   **Media Bin / Import:** Area to import video clips, photos, and music from your device's gallery.\n*   **Preview Window:** Shows the video playback of your current edit.\n*   **Timeline:** Where you arrange your media clips in sequence. Video tracks are usually stacked (top track appears in front).\n*   **Tool Palette:** Buttons for editing functions (Split, Trim, Effects, Text, Audio, etc.).\n*   **Playback Controls:** Play, Pause, Rewind/Forward through the timeline.\n\n## Basic Editing Workflow\n\n1.  **Start New Project:** Create a new project within the app.\n2.  **Import Media:** Tap 'Import' or '+' button. Select video clips, background images/videos, and music from your device library.\n3.  **Arrange on Timeline:** Drag imported media clips onto the timeline tracks.\n    *   Video clips usually go on main video tracks.\n    *   Backgrounds for green screen footage go on a track BELOW the green screen clip.\n    *   Music goes on the audio track.\n4.  **Trim Clips:** Select a clip on the timeline. Drag the handles at the beginning or end of the clip to shorten it (remove unwanted parts).\n5.  **Split Clips:** Move the playhead (vertical line indicating current time) to where you want to cut a clip. Select the clip, then tap the 'Split' or 'Cut' tool (often looks like scissors). This divides the clip into two separate parts.\n6.  **Reorder Clips:** Tap and hold a clip on the timeline, then drag it left or right to change its position in the sequence.\n\n## Using Green Screen (Chroma Key)\n\n1.  Place your green screen footage on an upper video track.\n2.  Place your desired background image or video on a track directly below it.\n3.  Select the green screen video clip on the timeline.\n4.  Find the 'Effects' or 'Keying' menu and select 'Chroma Key' or 'Green Screen'.\n5.  Use the color picker tool (if provided) to tap on the green area in the preview window. The app should remove the green.\n6.  Adjust tolerance/sensitivity sliders (if available) to fine-tune the keying – remove green spill without making subject transparent.\n\n## Adding Titles & Text\n\n1.  Move playhead to where you want text to appear.\n2.  Tap the 'Text' or 'Title' tool.\n3.  Type your text.\n4.  Customize font, size, color, and position.\n5.  Adjust the duration of the text clip on the timeline.\n\n## Adding Music & Sound Effects\n\n1.  Import audio file into Media Bin.\n2.  Drag audio file onto the designated Audio Track on the timeline.\n3.  Adjust volume level of the audio track relative to the video clips' original audio.\n4.  Trim audio clip if needed.\n\n## Stop Motion Animation\n\n*   Some versions of the app may have a dedicated Stop Motion mode.\n*   This typically involves capturing photos one by one within the app.\n*   You physically move your objects slightly between each photo capture.\n*   The app then sequences these photos into a video clip.\n*   Follow specific in-app instructions for Stop Motion mode.\n\n## Exporting Your Video\n\n1.  Once editing is complete, tap the 'Export' or 'Share' button.\n2.  Choose export resolution/quality settings (e.g., 720p, 1080p).\n3.  The app will render the video file.\n4.  Save the finished video to your device gallery or share directly to social media platforms."}
{"_id": "CS-VID-001_CPIG_v1.0", "product_id": "CS-VID-001", "product_name": "StoryReel Video Editor Kit", "doc_type": "Creative Project Ideas Guide", "version": "1.0", "title": "StoryReel Creative Project Ideas", "language": "en-US", "format": "Markdown", "text": "# StoryReel Creative Project Ideas (v1.0)\n\nFun ideas for your video creations!\n\n## Green Screen Magic\n\n*   **Travel Anywhere:** Film yourself in front of the green screen talking about a place, then replace the green with photos or videos of that location (Paris, jungle, outer space!).\n*   **Weather Reporter:** Stand in front of the green screen and pretend to give a weather report. Replace the green with weather map graphics or videos of sun/rain/snow.\n*   **Superhero Flight:** Film yourself jumping or pretending to fly against the green screen. Replace the background with a cityscape or sky. Add simple motion effects in the editor.\n*   **Invisibility Cloak:** Drape the green screen fabric over an object or part of your body. Use the chroma key tool to make that part disappear!\n*   **Talking Pet:** Film your pet in front of the green screen. Record your voice separately. Edit to make it look like your pet is talking against a funny background.\n\n## Stop Motion Stories\n\n*   **Lego Brick Film:** Use Lego figures and bricks. Move them tiny amounts between each photo capture to create an animated adventure.\n*   **Claymation:** Use modeling clay figures. Change their poses slightly between photos.\n*   **Drawing Comes to Life:** Draw parts of a scene on paper. Take a photo. Add more drawing elements. Take another photo. Repeat to make the drawing appear to animate.\n*   **Object Animation:** Make everyday objects (toys, fruit, tools) appear to move on their own by moving them slightly between photos.\n\n## General Video Ideas\n\n*   **Mini Movie Trailer:** Film short, exciting clips and edit them together with dramatic music and text titles to create a trailer for an imaginary movie.\n*   **How-To Video:** Film yourself demonstrating how to do something simple (a craft, a magic trick, a simple recipe).\n*   **Music Video:** Lip sync or dance to your favorite song. Film clips in different locations or with different outfits and edit them together.\n*   **Time Lapse:** (If app/device supports it) Set up your camera overlooking something that changes slowly (clouds moving, flower opening, ice melting) and record a time-lapse video.\n*   **News Report:** Create a short, funny news segment reporting on events happening in your house or neighborhood.\n\n## Tips for Better Videos\n\n*   **Plan Your Shots:** Think about your story or idea before you start filming.\n*   **Good Lighting:** Film in well-lit areas. Avoid harsh shadows, especially on the green screen.\n*   **Steady Camera:** Use the included stand or prop your device securely to avoid shaky footage.\n*   **Clear Audio:** Record in a quiet place. Speak clearly if recording voice.\n*   **Keep it Short & Sweet:** Shorter videos are often more engaging!\n*   **Experiment:** Try different effects, transitions, and music available in the app."}
{"_id": "CS-VID-001_TSF_v1.0", "product_id": "CS-VID-001", "product_name": "StoryReel Video Editor Kit", "doc_type": "Troubleshooting & Support FAQ", "version": "1.0", "title": "StoryReel Kit & App Troubleshooting & Support FAQ", "language": "en-US", "format": "Markdown", "text": "# StoryReel Kit & App Troubleshooting & Support FAQ (v1.0)\n\nSolving common video creation problems.\n\n## Kit Hardware Issues\n\n*   **Clip-on Lens Doesn't Fit / Blurry Image:**\n    *   Ensure lens is centered directly over your device's camera lens.\n    *   Make sure lens is clean (use microfiber cloth).\n    *   Some phone cases may prevent proper lens alignment - try removing case.\n    *   Macro lens requires being VERY close to the subject to be in focus.\n*   **Green Screen Wrinkled / Uneven:**\n    *   Try smoothing it out as much as possible. Gentle steaming (from a distance) might help, but test on a small corner first - **do not iron directly unless fabric allows.**\n    *   Good, even lighting is more important than perfect smoothness. Avoid shadows falling on the screen.\n*   **Stand Unstable:**\n    *   Ensure stand legs are fully extended/locked.\n    *   Place on a flat, level surface.\n    *   Make sure device is securely held in the clamp/holder.\n\n## App & Editing Issues\n\n*   **App Crashing / Freezing:**\n    *   Ensure your device meets the app's minimum OS and hardware requirements.\n    *   Close other background apps.\n    *   Check for updates for the StoryReel app in your app store.\n    *   Restart your device.\n    *   Try reinstalling the app (Warning: May delete project data unless saved externally or cloud-synced).\n*   **Green Screen Effect Not Working Well (Patchy, Wrong Color Removed):**\n    *   **Lighting is Key:** Ensure the green screen is VERY evenly lit, without bright hotspots or dark shadows.\n    *   **Subject Lighting:** Ensure the subject in front of the screen is also well-lit, separately from the screen if possible.\n    *   **Distance:** Keep subject a little distance away from the green screen to avoid green light reflecting onto them ('green spill').\n    *   **Color Picker:** Use the Chroma Key color picker accurately on the main green shade.\n    *   **Adjust Tolerance:** Fine-tune the tolerance/sensitivity sliders in the Chroma Key effect settings.\n    *   **Avoid Green:** Subject should not wear green.\n*   **Video Playback Stuttering in Editor:**\n    *   Editing HD video requires significant device resources. Close other apps.\n    *   App might create lower-resolution proxy files for smoother editing (check settings).\n    *   Ensure device has sufficient free storage space.\n*   **Cannot Import Media:**\n    *   Check if file format is supported by the app (common formats like MP4, MOV, JPG, PNG, MP3 usually are).\n    *   Ensure app has permission to access your device's photo/video library.\n*   **Export Fails or Takes Very Long:**\n    *   Check device storage space.\n    *   Try exporting at a lower resolution.\n    *   Close other apps during export.\n    *   Ensure device is charged or plugged in.\n    *   Very long or complex projects naturally take longer to render.\n\n## Contacting Support\n\n*   Visit Kinetic Constructs support website or email support with kit model (CS-VID-001), app version, device model/OS, and problem description."}
{"_id": "CS-VID-001_CSG_v1.0", "product_id": "CS-VID-001", "product_name": "StoryReel Video Editor Kit", "doc_type": "Care & Safety Guide", "version": "1.0", "title": "StoryReel Video Editor Kit Care & Safety Guide", "language": "en-US", "format": "Markdown", "text": "# StoryReel Video Editor Kit Care & Safety Guide (v1.0)\n\nTaking care of your video kit components.\n\n## Care Instructions\n\n*   **Green Screen:** Fold carefully along creases when storing to minimize wrinkles. Spot clean gently with a damp cloth if necessary (check fabric care tag if available). Store away from direct sunlight to prevent fading.\n*   **Clip-on Lenses:** Keep lenses clean using a microfiber cloth. Store them in their protective caps or pouch (if included) to avoid scratches. Attach and remove from device camera gently.\n*   **Stand:** Keep clean. Ensure moving parts/clamps operate smoothly. Do not overtighten clamps.\n*   **General:** Store kit components together in a safe place to avoid losing small parts.\n\n## Safety Precautions\n\n*   **Small Parts (Lenses, Clips):** Can be a choking hazard for young children. Recommended for ages 9+.\n*   **Setup Stability:** Ensure the green screen and phone stand are set up securely to prevent them from falling over.\n*   **Trip Hazard:** Keep cables (if using external lights or chargers) and backdrop stand legs tidy.\n*   **Eye Safety (Lighting):** If using additional bright lights for filming, avoid staring directly into them.\n*   **App Usage:** Follow standard safety practices for using smartphone/tablet apps (privacy settings, screen time limits).\n\nThis kit primarily consists of passive components; main safety relates to proper setup and handling of small parts."}
{"_id": "CS-PRJ-001_QSG_v1.0", "product_id": "CS-PRJ-001", "product_name": "ImagiGlow Story Projector", "doc_type": "Quick Start Guide", "version": "1.0", "title": "ImagiGlow Story Projector Quick Start Guide", "language": "en-US", "format": "Markdown", "text": "# ImagiGlow Story Projector Quick Start Guide (v1.0)\n\nLet the stories shine!\n\n## What's in the Box\n\n*   ImagiGlow Projector Unit\n*   Power Adapter\n*   Set of Story Discs\n*   App Download Card\n*   This Quick Start Guide\n\n## Setting Up the Projector\n\n1.  **Placement:** Place the projector on a stable surface, aiming it towards a blank wall or screen in a dimly lit room.\n2.  **Connect Power:** Plug the Power Adapter into the projector and a wall outlet.\n3.  **Power On:** Press the Power Button on the projector. The main light should turn on.\n\n## App Installation & Connection\n\n1.  Use the App Download Card to find and install the 'ImagiGlow Stories' app on your smartphone or tablet (iOS/Android).\n2.  **Enable Bluetooth:** Make sure Bluetooth is turned ON on your phone/tablet.\n3.  **Launch App:** Open the ImagiGlow Stories app.\n4.  **Pairing:** Follow the app's prompts to connect to the projector. It may automatically scan or ask you to select 'ImagiGlow Projector' from a list. The projector might have a light indicating Bluetooth status.\n\n## Starting a Story\n\n1.  **Insert Disc:** Choose a Story Disc. Gently insert it into the disc slot on the projector until it clicks or feels seated.\n2.  **Select Story in App:** The app should recognize the inserted disc and display the corresponding story title(s).\n3.  **Tap Story to Start:** Select the story you want to begin.\n4.  **Focus:** Use the focus ring or slider on the projector lens to make the projected image clear on the wall.\n5.  **Follow App Prompts:** The app will guide the story, providing narration and sound effects played through your phone/tablet speaker. The projector will display images corresponding to the story progress.\n6.  **Interaction:** The app may present choices at certain points in the story. Tap your choice on the app screen to continue.\n\n## Changing Discs\n\n1.  Stop the current story in the app.\n2.  Gently eject the current disc (using eject button or by pulling out).\n3.  Insert a new disc.\n4.  Select the new story in the app.\n\n## Powering Off\n\n*   Press the Power Button on the projector.\n*   Close the app on your phone/tablet.\n\nSee the App User Guide (CS-PRJ-001_AUG_v1.0) for more details."}
{"_id": "CS-PRJ-001_AUG_v1.0", "product_id": "CS-PRJ-001", "product_name": "ImagiGlow Story Projector", "doc_type": "App User Guide", "version": "1.0", "title": "ImagiGlow Stories App User Guide", "language": "en-US", "format": "Markdown", "text": "# ImagiGlow Stories App User Guide (v1.0)\n\nYour control center for interactive projected stories.\n\n## Connecting to Projector\n\n1.  Ensure projector is powered ON.\n2.  Ensure Bluetooth is enabled on your phone/tablet.\n3.  Launch the ImagiGlow Stories app.\n4.  Tap the 'Connect Projector' icon (usually Bluetooth symbol).\n5.  Select 'ImagiGlow Projector' from the list of available devices.\n6.  Status indicator in the app confirms connection.\n\n## Main Screen & Library\n\n*(Screenshot: App main screen showing connected status and detected story disc)*\n\n*   **Connection Status:** Shows if projector is connected.\n*   **Detected Disc:** Displays the title or icon of the story disc currently inserted in the projector.\n*   **Story Library:** May show all available stories associated with the detected disc (some discs might have multiple short stories).\n*   **Settings:** Access app settings (volume, language, etc.).\n\n## Starting & Playing a Story\n\n1.  Insert desired Story Disc into the projector.\n2.  Wait for the app to recognize the disc and display available stories.\n3.  Tap the story title you wish to play.\n4.  The story begins: Narration and sounds play from your phone/tablet, while corresponding images are shown by the projector.\n5.  **Volume Control:** Use your device's volume buttons to adjust sound level.\n\n## Interactive Choices\n\n*(Screenshot: App screen showing a story choice point)*\n\n*   At certain points, the story may pause, and the app will display two or more choices (e.g., \"Which way should the character go? Left / Right\").\n*   Tap your desired choice on the app screen.\n*   The story narration and projected images will continue based on your selection.\n\n## Story Controls During Playback\n\n*   **Pause/Play:** Button to pause and resume the story.\n*   **Back/Restart:** Button to go back to a previous point or restart the story.\n*   **Exit Story:** Button to stop the current story and return to the library/main screen.\n\n## Settings Menu\n\n*   **Audio Output:** May allow selecting audio output (device speaker vs Bluetooth speaker if paired).\n*   **Language:** Select narration language if multiple options are available for a story.\n*   **Brightness Control (Projector):** May offer limited control over projector brightness via the app.\n*   **Help/Support:** Links to troubleshooting or support info.\n\n## Disconnecting\n\n*   Connection usually drops automatically when the app is closed or the projector is turned off.\n*   You can manually disconnect via the Bluetooth settings in the app or your device."}
{"_id": "CS-PRJ-001_CPIG_v1.0", "product_id": "CS-PRJ-001", "product_name": "ImagiGlow Story Projector", "doc_type": "Creative Project Ideas Guide", "version": "1.0", "title": "ImagiGlow Story Projector Creative Project Ideas", "language": "en-US", "format": "Markdown", "text": "# ImagiGlow Story Projector Creative Project Ideas (v1.0)\n\nEnhance the storytelling experience!\n\n## Activity 1: Act It Out\n\n*   **Concept:** Combine projected images with live action.\n*   **How:** As the story plays, encourage kids to act out the characters or actions being shown on the wall. Pause the story at key moments for dramatic poses!\n\n## Activity 2: Sound Effect Crew\n\n*   **Concept:** Add your own live sound effects.\n*   **How:** Mute the sound on the app device (or turn volume very low). Assign different sound effects to different children (e.g., one person makes footstep sounds, another makes animal noises, another makes weather sounds) to be performed live as the story progresses visually.\n\n## Activity 3: Alternate Endings / Choices\n\n*   **Concept:** Discuss the choices made and imagine different outcomes.\n*   **How:** When the app presents a choice point, pause the story. Discuss what might happen for each option *before* selecting one. After the story finishes, replay it and make different choices to see the variations.\n\n## Activity 4: Draw Your Own Scene\n\n*   **Concept:** Extend the story visually.\n*   **How:** After a story finishes, have kids draw their favorite scene, a character, or what they think happens next. They can try to mimic the art style of the projected images.\n\n## Activity 5: Shadow Puppet Show\n\n*   **Concept:** Combine projection with shadow puppets.\n*   **How:** Use a simple background image disc (if available) or a scene with space. Have kids use their hands or simple cut-out shapes on sticks between the projector and the wall to create shadow puppets that interact with the projected scene.\n\n## Activity 6: Create Your Own Story Disc (Advanced/Imaginary)\n\n*   **Concept:** Design a new story for the projector.\n*   **How:** (This is a creative exercise, as making real discs isn't possible). Have kids write a short story, draw key scenes on paper circles (the size of the discs), and decide where interactive choices would go. They can then 'present' their story using their drawings and telling the narration.\n\n## Tips for Atmosphere\n\n*   **Dim the Lights:** Make the room dark for the best projection quality.\n*   **Cozy Seating:** Arrange pillows or blankets for comfortable viewing.\n*   **Snacks!** Story time is always better with snacks (keep away from projector!)."}
{"_id": "CS-PRJ-001_TSF_v1.0", "product_id": "CS-PRJ-001", "product_name": "ImagiGlow Story Projector", "doc_type": "Troubleshooting & Support FAQ", "version": "1.0", "title": "ImagiGlow Projector & App Troubleshooting & Support FAQ", "language": "en-US", "format": "Markdown", "text": "# ImagiGlow Projector & App Troubleshooting & Support FAQ (v1.0)\n\nSolving common projection and story issues.\n\n## Projector Hardware Issues\n\n*   **Projector Won't Turn On:**\n    *   Ensure power adapter is securely plugged into both the projector and a working wall outlet.\n    *   Try a different wall outlet.\n    *   Check if power adapter light (if any) is on.\n    *   Possible internal power issue - contact support.\n*   **Projected Image Blurry:**\n    *   Adjust the focus ring/slider on the projector lens until the image is sharp.\n    *   Ensure projector is at an appropriate distance from the wall (not too close, not too far).\n    *   Clean the projector lens gently with a microfiber cloth.\n*   **Image Dim / Washed Out:**\n    *   Make the room darker.\n    *   Check if brightness can be adjusted via the app settings.\n    *   Projector bulb may be nearing end-of-life (if used extensively) - contact support.\n*   **Disc Won't Insert / Eject:**\n    *   Ensure disc is oriented correctly.\n    *   Do not force the disc.\n    *   Check slot for obstructions.\n    *   If eject mechanism seems stuck, contact support.\n*   **Projector Overheating / Shuts Off:**\n    *   Ensure ventilation openings on the projector are not blocked.\n    *   Allow projector to cool down.\n    *   Operate in a room with normal temperature.\n    *   If persists, contact support.\n\n## App & Connectivity Issues\n\n*   **App Cannot Connect to Projector:**\n    *   Ensure projector is ON and within Bluetooth range (usually ~10 meters).\n    *   Ensure Bluetooth is enabled on your phone/tablet.\n    *   Restart the projector and the app.\n    *   Try forgetting the device in your phone's Bluetooth settings and re-pairing through the app.\n    *   Check for app updates.\n*   **App Doesn't Recognize Inserted Disc:**\n    *   Remove and re-insert the disc firmly.\n    *   Clean the disc surface gently.\n    *   Restart the app and the projector.\n    *   Ensure the disc is an official ImagiGlow story disc.\n    *   Possible issue with disc reader or disc itself - try another disc.\n*   **No Sound from App:**\n    *   Check phone/tablet volume is turned up.\n    *   Check if device is muted or connected to other Bluetooth speakers/headphones.\n    *   Check app's internal volume settings (if any).\n    *   Restart app.\n*   **Story Pauses / App Freezes:**\n    *   Close other background apps on your phone/tablet.\n    *   Ensure stable Bluetooth connection.\n    *   Restart app and projector.\n    *   Check for app updates.\n\n## Contacting Support\n\n*   Visit Kinetic Constructs support website or email support with model (CS-PRJ-001), app version, device model/OS, and problem description."}
{"_id": "CS-PRJ-001_CSG_v1.0", "product_id": "CS-PRJ-001", "product_name": "ImagiGlow Story Projector", "doc_type": "Care & Safety Guide", "version": "1.0", "title": "ImagiGlow Story Projector Care & Safety Guide", "language": "en-US", "format": "Markdown", "text": "# ImagiGlow Story Projector Care & Safety Guide (v1.0)\n\nKeeping story time safe and bright.\n\n## Care Instructions\n\n*   **Cleaning:** Wipe the projector body with a soft, dry cloth. Clean the lens gently with a lens cloth or microfiber cloth suitable for optics. Avoid abrasive cleaners.\n*   **Discs:** Handle story discs by the edges to avoid fingerprints on the surface. Store discs in their case or a safe place to prevent scratches.\n*   **Ventilation:** Keep ventilation openings clear of dust and obstructions.\n*   **Storage:** Store the projector and discs in a cool, dry place away from direct sunlight.\n*   **Bulb:** The projector uses an LED light source, which typically has a long life and is not user-replaceable.\n\n## Safety Precautions\n\n*   **Electrical Safety:**\n    *   Use ONLY the power adapter supplied with the projector.\n    *   Ensure adapter is plugged into a suitable wall outlet.\n    *   Do not expose the projector or power adapter to water or liquids.\n    *   Unplug when not in use for extended periods or during thunderstorms.\n    *   Do not attempt to open the projector casing.\n*   **Eye Safety:** The projector uses a bright LED light. **DO NOT stare directly into the projector lens** when it is powered on. Maintain a comfortable viewing distance from the projected image.\n*   **Heat:** The projector may become warm during operation, especially near ventilation openings. This is normal, but ensure adequate airflow around the unit.\n*   **Placement Stability:** Place the projector on a stable, level surface where it cannot easily be knocked over.\n*   **Trip Hazard:** Keep the power cord routed safely.\n*   **Small Parts (Discs):** While robust, discs could potentially break into smaller pieces if mishandled, posing a choking hazard. Recommended for ages 5+.\n\nThis device is intended for home entertainment and storytelling."}
{"_id": "CS-EXP-001_SI_v1.0", "product_id": "CS-EXP-001", "product_name": "ProtoPen Filament Refill Pack (Multi-Color)", "doc_type": "Safety Information", "version": "1.0", "title": "ProtoPen Filament Refill Safety Information", "language": "en-US", "format": "Markdown", "text": "# ProtoPen Filament Refill Safety Information (v1.0)\n\nSafe handling of your 3D pen filament.\n\n*   **Compatibility:** This filament is specifically designed for use with the Kinetic Constructs ProtoPen (CS-3DP-001) or other compatible LOW-TEMPERATURE 3D pens. **DO NOT use this filament in standard 3D printers or high-temperature 3D pens** which operate at much higher temperatures (190°C+). Using this filament in incompatible devices may cause severe damage and potentially release harmful fumes.\n*   **Material:** Made from non-toxic, low-temperature thermoplastic (e.g., PCL - Polycaprolactone, or similar). Refer to packaging for specific material type.\n*   **Choking Hazard:** Filament strands can be a choking hazard for young children and pets if ingested. Store filament out of reach. Intended for use by ages 8+ with supervision.\n*   **Storage:** Store filament in a cool, dry place. Reseal packaging if possible to minimize moisture absorption, which can affect performance.\n*   **Handling:** Cut filament ends cleanly before loading into the pen.\n*   **Disposal:** Dispose of scrap filament pieces as regular household waste (check local regulations if specific plastic recycling programs exist for the material type).\n*   **Intended Use:** For use in 3D drawing pens only. Not intended as a toy on its own."}
{"_id": "CS-EXP-002_SI_v1.0", "product_id": "CS-EXP-002", "product_name": "MiniForge PLA Filament Spool (Single Color)", "doc_type": "Safety Information", "version": "1.0", "title": "MiniForge PLA Filament Safety Information", "language": "en-US", "format": "Markdown", "text": "# MiniForge PLA Filament Safety Information (v1.0)\n\nSafe handling and use of PLA filament.\n\n*   **Compatibility:** This PLA (Polylactic Acid) filament is designed for use with FDM (Fused Deposition Modeling) 3D printers like the Kinetic Constructs MiniForge (CS-3DP-002) that operate typically in the 190-220°C nozzle temperature range. Verify compatibility with your specific 3D printer model if not using MiniForge.\n*   **Material:** PLA is a biodegradable thermoplastic derived from renewable resources like corn starch or sugar cane. While generally considered safe to print with, ensure adequate ventilation during printing.\n*   **Storage:** PLA absorbs moisture from the air, which can negatively impact print quality (causing bubbles, stringing, weak prints). Store filament spools in a cool, dry place, ideally in a sealed bag or container with desiccant packs.\n*   **Handling:** Keep filament clean and dust-free. Ensure filament feeds smoothly from the spool into the printer extruder without tangles.\n*   **Printing Temperatures:** Use within the recommended temperature range for your printer and the specific PLA filament (usually printed on the spool label, e.g., 195-215°C).\n*   **Ventilation:** Always operate your 3D printer in a well-ventilated area to minimize potential exposure to microplastic particles and volatile organic compounds (VOCs) emitted during the melting process.\n*   **Choking Hazard:** Filament strands and small 3D printed parts can be choking hazards for young children and pets. Keep filament and prints out of reach. Intended for use by ages 10+ with supervision.\n*   **Disposal:** Dispose of scrap filament and failed prints according to local plastic recycling capabilities (PLA is often classified under Recycling Code 7, check local facilities) or as regular household waste."}
